Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/domain-ldap.po
Languages: de

source: When using *OpenID Connect*, resolvable DNS names and verifiable certificates are a prerequisite. This is especially true for client computers of end users who need to access both the DNS resolvable host names of the Web service and the OpenID Connect Provider. In addition, the externally connected Web services must be able to establish a connection to the OpenID Connect Provider in order to be able to retrieve the user attributes.
de: Bei der Verwendung von *OpenID Connect* ist auf korrekte, auflösbare DNS Namen und verifizierbare Zertifikate zu achten. Zu beachten ist dies insbesondere bei Client-Rechnern von Endbenutzern, die sowohl auf die per DNS auflösbaren Hostnamen des Web-Dienst als auch auf den OpenID Connect Provider zugreifen müssen. Außerdem müssen die extern angebundenen Web-Dienste eine Verbindung zum OpenID Connect Provider herstellen können, um darüber die Benutzerattribute abrufen zu können.

source: In the special case where the DNS name of the OIDC provider is to be changed, the corresponding value must first be adjusted in the app settings of the :program:`OpenID Connect Provider` app. Since there are diverse scenarios for the availability of the provider after changing the DNS name, the web server configuration cannot be changed automatically. For example, depending on the configured DNS name, the UCS Apache configuration has to be adapted. The configuration file :file:`/etc/apache2/conf-available/openid-connect-provider.conf` must be made available under the set DNS name in a virtual host.
de: Im speziellen Fall, wo der DNS Namen des OIDC-Providers geändert werden soll, muss zunächst der entsprechende Wert in den App Einstellungen der :program:`OpenID Connect Provider` App angepasst werden. Da es diverse Szenarien für die Erreichbarkeit des Providers nach der Änderung des DNS Namens gibt, kann keine automatische Änderung der Webserverkonfiguration vorgenommen werden. Es muss so zum Beispiel je nach konfiguriertem DNS Namen noch die Apache Konfiguration unter UCS angepasst werden. Die Konfigurationsdatei :file:`/etc/apache2/conf-available/openid-connect-provider.conf` muss unter dem gesetzten DNS Namen in einem Virtual Host verfügbar gemacht werden.

source: With version 2 of the OIDC-Provider App the authentication to OpenID Connect works via the SAML Identity Provider of the UCS domain. If the SAML Identity Provider is not reachable at the default URL :samp:`https://ucs-sso.{[Domain name]}`, the correct URL under which the SAML IdP metadata for the UCS domain can be retrieved must be entered correctly in the app settings. If this URL is configured incorrectly, the OpenID Connect Provider will not start.
de: Mit Version 2 der OIDC-Provider App funktioniert die Authentifizierung an :program:`OpenID Connect` über den SAML Identity Provider der UCS Domäne. Ist der SAML Identity Provider von der Standardkonfiguration abweichend nicht unter :samp:`https://ucs-sso.{[domain.name]}` erreichbar, muss in den App Einstellungen die URL korrekt eingetragen werden, unter der die SAML IdP Metadaten für die UCS Domäne abgerufen werden können. Bei inkorrekter Konfiguration dieser URL startet der OpenID Connect Provider nicht.

source: With SAML authentication, the authorization for the use of the OpenID Connect Provider and thus for all apps connected via OIDC can be controlled via SAML authorizations. By default, the group ``Domain Users`` is enabled for access when the app is installed. If this permission should be removed, the corresponding option must also be activated in the app settings so that the permission is not automatically added again.
de: Mit der Authentifizierung per SAML ist die Autorisierung für die Nutzung des OpenID Connect Providers und damit zu allen per OIDC angebundenen Apps über SAML Berechtigungen steuerbar. Standardmäßig wird bei der Installation der App die Gruppe ``Domänenbenutzer`` für den Zugriff freigeschaltet. Wenn diese Berechtigung entfernt werden soll, muss zusätzlich in den App Einstellungen die entsprechende Option aktiviert werden, damit die Berechtigung nicht automatisch erneut hinzugefügt wird.

source: The OpenID Connect Provider logs actions via the Docker Daemon. The output can be viewed with the command :command:`univention-app logs openid-connect-provider`.
de: Der OpenID Connect Provider protokolliert Aktionen über den Docker Daemon. Die Ausgaben können beispielsweise über das Kommando :command:`univention-app logs openid-connect-provider` eingesehen werden.

source: Password hashes in the directory service
de: Passwort-Hashes im Verzeichnisdienst

source: User password hashes are stored in the directory service in the ``userPassword`` attribute. The :program:`crypt` library function is used to hash passwords. The actual hashing method can be configured via the |UCSUCRV| :envvar:`password/hashing/method`, ``SHA-512`` is used by default.
de: Passwort-Hashes von Benutzern werden u.a. im Attribut ``userPassword`` im Verzeichnisdienst gespeichert. Für die Generierung der Passwort-Hashes wird auf die :program:`crypt` Bibliotheksfunktion zurückgegriffen. Die eigentliche Hash-Funktion kann über die |UCSUCRV| :envvar:`password/hashing/method` definiert werden, standardmäßig wird ``SHA-512`` verwendet.

source: As an alternative |UCSUCS| (from version :uv:erratum:`4.4x887` on) offers the option of using :program:`bcrypt` as hashing method for passwords of user accounts. To activate :program:`bcrypt` support in OpenLDAP the |UCSUCRV| :envvar:`ldap/pw-bcrypt` has to bet set to ``true`` on all LDAP servers. Otherwise it is not possible authenticate with a :program:`bcrypt` hash as password hash. Additionally the |UCSUCRV| :envvar:`password/hashing/bcrypt` has to be set to ``true``, again on all servers, to activate :program:`bcrypt` as the hashing method for setting or changing user password.
de: Alternativ dazu bietet |UCSUCS| ab :uv:erratum:`4.4x887` die Möglichkeit :program:`bcrypt` als Hash-Funktion für Benutzerkonten zu verwenden. Dafür muss zunächst auf allen LDAP-Servern die |UCSUCRV| :envvar:`ldap/pw-bcrypt` auf ``true`` gesetzt werden um das nötige Modul für OpenLDAP zu aktivieren. Andernfalls ist eine Anmeldung am LDAP-Server mit einem :program:`bcrypt` Hash nicht möglich. Damit beim Ändern von Passwörtern nun :program:`bcrypt` Hashes generiert werden, muss ebenfalls auf allen Servern die |UCSUCRV| :envvar:`password/hashing/bcrypt` auf ``true`` gesetzt werden.

source: In addition, the :program:`bcrypt` cost factor and the :program:`bcrypt` variant can be configured via the |UCSUCRV|\ s :envvar:`password/hashing/bcrypt/cost_factor` (default ``12``) and :envvar:`password/hashing/bcrypt/prefix` (default ``2b``).
de: Zusätzlich können der *bcrypt Cost Factor* und die :program:`bcrypt` Variante über die |UCSUCRV|\ n :envvar:`password/hashing/bcrypt/cost_factor` (``12``) und :envvar:`password/hashing/bcrypt/prefix` (``2b``) angepasst werden.

source: :program:`bcrypt` is limited to a maximum of 72 characters. So only the first 72 characters of the password are used to generate the hashes.
de: :program:`bcrypt` ist auf maximal 72 Zeichen begrenzt. Für die Generierung der Hashes werden also nur die ersten 72 Zeichen des Kennwort verwendet.

source: SAML (Security Assertion Markup Language) is an XML-based standard for exchanging authentication information in order to allow single sign-on across domain boundaries. UCS provides a fail-safe SAML identity provider on a |UCSPRIMARYDN| as well as |UCSBACKUPDN|. The SAML identity provider is registered at an external service with a cryptographic certificate and establishes a trust relationship. The user then only needs to authenticate himself against UCS and can use the service without renewed authentication.
de: SAML (Security Assertion Markup Language) ist ein XML-basierter Standard zum Austausch von Authentifizierungsinformationen, der *Single Sign-On* über Domänengrenzen hinweg erlaubt. UCS stellt auf dem |UCSPRIMARYDN| und den |UCSBACKUPDN| einen ausfallsicheren SAML Identity Provider bereit. Über ein kryptografisches Zertifikat wird der SAML Identity Provider bei einem externen Dienst fest registriert und vertraut diesem. Der Benutzer authentifiziert sich dann einmalig gegenüber UCS und kann den Dienst ohne erneute Authentifizierung nutzen.

source: The single sign-on login page
de: Die Single Sign-On Anmeldeseite

source: The SAML 2.0 compatible UCS identity provider is provided by the integration of :program:`simplesamlphp`.
de: Der SAML 2.0 kompatible UCS Identity Provider wird durch die Integration von :program:`simplesamlphp` bereitgestellt.

source: The UCS identity provider is tightly integrated into the UCS domain. Clients that will be used to access the UCS identity provider have to be able to resolve DNS records in the UCS domain. The domain DNS Servers should therefore be configured on all clients in order to be able to resolve the central DNS record, which by default is :samp:`ucs-sso.{[Domain name]}`.
de: Der UCS Identity Provider ist eng in die UCS Domäne eingebunden. Daher müssen Rechner, von denen der UCS Identity Provider genutzt werden soll, DNS-Namen in der UCS-Domäne auflösen können. Die DNS-Server der Domäne sollten auf allen Clients eingetragen sein, um den zentralen DNS-Namen, im Normalfall :samp:`ucs-sso.{[domainname]}`, auflösen zu können.

source: The UCS identity provider is automatically installed on |UCSPRIMARYDN| and |UCSBACKUPDN|\ s. Further |UCSBACKUPDN|\ s can be made available in the domain to increase fail-safe safety. The default DNS record :samp:`ucs-sso.{[Domain name]}` is registered to increase fail-safe access to the UCS identity provider. The SSL certificate for this record is kept on all participating systems in the domain. It is advised to install the UCS domain root certificate on all clients that are using *single sign-on*.
de: Der UCS Identity Provider wird auf dem |UCSPRIMARYDN| und |UCSBACKUPDN| mit der Installation automatisch eingerichtet. Um die Ausfallsicherheit innerhalb der Domäne zu erhöhen, können weitere Systeme der Rolle |UCSBACKUPDN| verfügbar gemacht werden. Für den ausfallsicheren Zugriff auf den UCS Identity Provider wird standardmäßig der DNS-Eintrag :samp:`ucs-sso.{[domainname]}` registriert. Das für diesen Eintrag vorgesehene TLS Zertifikat wird auf allen beteiligten Systemen der Domäne vorgehalten. Es wird empfohlen, das Wurzelzertifikat der UCS Domäne auf allen Rechnern, die *Single Sign-On* nutzen, zu installieren.

source: It is possible to associate the SAML authentication with the Kerberos login. This means that users with a valid Kerberos ticket, for example after logging on to Windows or Linux, can sign in to the identity provider without having to manual re-authenticate.
de: Es besteht die Möglichkeit, die SAML-Authentifizierung mit der Kerberos Anmeldung zu verknüpfen. Das bedeutet, dass sich Nutzer mit einem gültigen Kerberos Ticket, z.B. nach einer Anmeldung an Windows oder Linux, ohne eine erneute manuelle Authentifizierung am Identity Provider anmelden können.

source: To allow Kerberos authentication at the identity provider, the |UCSUCRV| :envvar:`saml/idp/authsource` has to be changed from ``univention-ldap`` to ``univention-negotiate``. The web browsers must be configured to transfer the Kerberos ticket to the SAML Identity Provider. Here are two examples for the configuration of Firefox and Internet Explorer / Microsoft Edge:
de: Um die Kerberos Authentifizierung am Identity Provider zuzulassen, muss die |UCSUCRV| :envvar:`saml/idp/authsource` von ``univention-ldap`` auf ``univention-negotiate`` gesetzt werden. Die Webbrowser müssen entsprechend so konfiguriert werden, so dass das Kerberos Ticket an den SAML Identity Provider übertragen wird. Im folgenden beispielhaft für Firefox und den Internet Explorer / Microsoft Edge:

source: In the extended Firefox configuration, which can be reached by entering ``about:config`` in the Firefox address line, the address of the identity provider must be entered in the option ``network.negotiate-auth.trusted-uris``, which is :samp:`ucs-sso.{[Domain name]}` by default.
de: In der erweiterten Firefox Konfiguration, diese ist erreichbar über die Eingabe von ``about:config`` in der Firefox Adresszeile, muss bei der Option ``network.negotiate-auth.trusted-uris`` die Adresse des Identity Providers eingetragen werden, also in der Standardeinstellung :samp:`ucs-sso.{[domainname]}`.

source: In the Control Panel, the :guilabel:`Internet Options` must be opened, followed by :menuselection:`Security --> Local Intranet --> Sites --> Advanced`. The address of the identity provider has to be added, which is :samp:`ucs-sso.{[Domain name]}` by default.
de: In der Systemsteuerung müssen die :guilabel:`Internetoptionen` geöffnet werden und dort wird unter :menuselection:`Sicherheit --> Lokales Intranet --> Sites --> Erweitert` die Adresse des Identity Providers hinzugefügt, also in der Standardeinstellung :samp:`ucs-sso.{[domainname]}`.

source: The Kerberos authentication can be restricted to certain IP subnets by setting the |UCSUCRV| :envvar:`saml/idp/negotiate/filter-subnets` for example to ``127.0.0.0/16,192.168.0.0/16``. This is especially useful to prevent a pop up login box being shown for clients which are not part of the UCS domain.
de: Die Kerberos Authentifizierung kann auf bestimmte IP Subnetze beschränkt werden, indem die |UCSUCRV| :envvar:`saml/idp/negotiate/filter-subnets` beispielsweise auf ``127.0.0.0/16,192.168.0.0/16`` gesetzt wird. Dies ist besonders nützlich, um zu verhindern, dass für Clients, die nicht zur UCS-Domäne gehören, ein Dialog für den Login angezeigt wird.

source: Login via single sign-on
de: Anmelden per Single Sign-On

source: The activation of *single sign-on* for the portal is described in :ref:`central-management-umc-login`. For this, :samp:`ucs-sso.{[Domain name]}` must be reachable. To login the domain credentials must be provided. For the login directly at the UCS system (i.e., without *single sign-on*), follow the link :guilabel:`Login without Single Sign On`.
de: Die Aktivierung von *Single Sign-On* für das Portal wird in :ref:`central-management-umc-login` beschrieben. Dafür muss :samp:`ucs-sso.{[Domain name]}` erreichbar sein. Anmeldedaten des Domänenkontos verwendet. Für den Login direkt am UCS-System (also ohne *Single Sign-On*) gelangt man über den Link :guilabel:`Ohne Single Sign-On anmelden`.

source: The design of the login dialog can be changed by editing :file:`/usr/share/univention-management-console-login/css/custom.css`. This file will never be altered or deleted during updates.
de: Über die Datei :file:`/usr/share/univention-management-console-login/css/custom.css` kann das Design des Anmeldedialogs angepasst werden. Diese Datei wird niemals automatisch überschrieben.

source: Other web services will redirect to the UCS identity provider login page in a similar fashion in order to carry out a *single sign-on*. After authenticating, the user will be forwarded back to the web service itself. These services need to be registered as described in :ref:`domain-saml-additional-serviceprovider`.
de: Andere Webdienste leiten ebenfalls auf die Anmeldeseite des UCS Identity Providers weiter, wenn ein *Single Sign-On* durchgeführt wird. Nach erfolgreicher Authentifizierung wird der Benutzer wieder auf die Seite des Webdienstes gesendet werden. Diese Dienste müssen, wie in :ref:`domain-saml-additional-serviceprovider` beschrieben, registriert werden.

source: The *single sign-on* for a particular service can be initiated from the UCS identity provider, as well. This saves an extra visit at the external web service which redirects to the authentication site. To do so, a link to the UCS identity provider page needs to be provided in the form of :samp:`https://ucs-sso.{[Domain name]}/simplesamlphp/saml2/idp/SSOService.php?spentityid={[Service provider identifier]}`.
de: Der *Single Sign-On* an einem Dienst kann auch vom UCS Identity Provider initiiert werden. Dies erspart den Umweg, zunächst den externen Dienst selbst aufzurufen und sich von dort zur Authentifizierung weiterleiten zu lassen. Dazu muss der Identity Provider mit einem Link der Form :samp:`https://ucs-sso.{[domainname]}/simplesamlphp/saml2/idp/SSOService.php?spentityid={[Service provider identifier]}` aufgerufen werden.

source: Adding a new external service provider
de: Hinzufügen eines neuen externen Service Providers

source: The UMC module :guilabel:`SAML identity provider` allows to manage all service providers that are registered at the UCS identity provider. Users have to be activated for a service provider, to be able to authenticate for it at the UCS identity provider. The service provider can be activated for groups, to allow authentication with that service provider for all users within that group. On the user's *Account* tab or the group's *General* tab, the service provider can to be added under *SAML settings*.
de: Die am UCS Identity Provider registrierten Service Provider können über das UMC-Modul :guilabel:`SAML Identity Provider` verwaltet werden. Benutzer müssen freigeschaltet werden, bevor sie sich am UCS Identity Provider für einen Dienst authentifizieren können. Service Provider können auch für Gruppen aktiviert werden, sodass sich alle Benutzer in dieser Gruppe für diesen Dienst authentifizieren können. Auf dem Reiter *Konto* eines Benutzers, oder dem Reiter *Allgemein* einer Gruppe, muss dazu unter *SAML Einstellungen* der Service Provider Eintrag hinzugefügt werden.

source: To register the UCS identity provider at an external service provider, the public part of the SAML certificate is required by the service provider. The certificate can be downloaded via a link in the UMC module. Some service providers may require the UCS identity provider XML metadata as a file upload. By default the XML file can be downloaded from the URL :samp:`https://ucs-sso.{[Domain name]}/simplesamlphp/saml2/idp/metadata.php`.
de: Um den UCS Identity Provider bei einem SAML Service Provider zu registrieren, wird der öffentliche Teil des SAML-Zertifikats auf dem Service Provider benötigt. Dieses kann über einen Download-Link im UMC-Modul heruntergeladen werden. Andere Service Provider benötigen die XML-Metadaten des Identity Providers in Form eines Datei-*Uploads*. In der Standardkonfiguration kann die XML-Datei unter der URL :samp:`https://ucs-sso.{[domainname]}/simplesamlphp/saml2/idp/metadata.php` heruntergeladen werden.

source: The following attributes can be configured when adding a new service provider.
de: Die folgenden Attribute können beim Anlegen eines neuen Service Provider-Eintrags konfiguriert werden.

source: General options when configuring a service provider
de: Allgemeine Felder bei der Anbindung eines Service Providers

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: Service provider activation status
de: Service Provider aktivieren

source: If activated, the configuration for the service provider is activated and is ready for authentication.
de: Ist diese Option gesetzt, wird die Konfiguration des Service Providers aktiviert und steht für die Anmeldung bereit.

source: Service provider identifier
de: Bezeichner des Service Providers

source: Defines the internal name of the service provider. The name is later selected at user objects, when giving them access to a service provider. The identifier cannot be changed later.
de: Definiert den internen Namen des Service Providers. Dieser wird später am Benutzerobjekt angezeigt und ausgewählt, um Benutzer für die Verbindung freizuschalten. Der Bezeichner kann später nicht mehr geändert werden.

source: Respond to this service provider URL after login
de: Antwort an diese Service Provider URL nach dem Login

source: After successful authentication, the user’s browser is redirected to the service provider. The redirection is done to this provided URL.
de: Nach dem erfolgreichen Login an UCS wird der Browser des Benutzers zurück zum Service Provider geleitet. Die Weiterleitung erfolgt an die hier angegebene URL.

source: Single logout URL for service provider
de: Single Logout URL des Service Providers

source: Service providers can offer a URL endpoint at which the session at the service provider can be terminated. If a user logs out at the UCS identity provider, the browser will get redirected to the provided URL to terminate the session.
de: Service Provider können einen URL Endpunkt anbieten, mit dem die Session am Service Provider beendet werden kann. Loggt sich der Benutzer am UCS Identity Provider aus, wird über die hier übergebene URL eine Abmeldung am Service Provider durchgeführt.

source: Format of ``NameID`` attribute
de: Format des ``NameID`` Attributs

source: The value ``NameIDFormat`` that the service provider receives. The service provider’s documentation should contain information about possible values. Example: ``urn:oasis:names:tc:SAML:2.0:nameid-format:transient`` or ``urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified``.
de: Der Wert ``NameIDFormat``, den der Service Provider erhält. Die Dokumentation des Service Providers sollte erwartete Formate erwähnen. Beispiel: ``urn:oasis:names:tc:SAML:2.0:nameid-format:transient`` oder ``urn:oasis:names:tc :SAML:1.1:nameid-format:unspecified``.

source: Name of the attribute that is used as ``NameID``
de: Name des Attributs, das als ``NameID`` verwendet wird

source: The LDAP attribute that is used to uniquely identify the user is provided here, e.g., ``uid``.
de: Hier kann das LDAP Attribut eingetragen werden, das für eine eindeutige Identifizierung des Benutzers am Service Provider verwendet wird, beispielsweise ``uid``.

source: Name of the organization for service provider
de: Name der Organisation des Service Providers

source: The value provided here will be shown on the UCS single sign-on login page. It helps the user to identify for which service they enter credentials.
de: Der hier eingetragene Wert wird auf der UCS Single Sign-On Anmeldeseite angezeigt. Dem Benutzer wird so dargestellt, für welchen Dienst er sich authentifiziert.

source: Description of this service provider
de: Beschreibung dieses Service Providers

source: The value provided here will be shown on the UCS single sign-on login page. A longer description about the service provider can be given here. The description will be shown on the login page in a separate paragraph.
de: Der hier eingetragene Wert wird auf der UCS Single Sign-On Anmeldeseite angezeigt. Hier kann eine längere Beschreibung über den Dienst angegeben werden, der auf der Login Seite in einem eigenen Absatz angezeigt wird.

source: Advanced settings when configuring a service provider
de: Erweiterte Felder bei der Anbindung eines Service Providers

source: URL to the service provider’s privacy policy
de: URL zur Datenschutzrichtlinie des Service Providers

source: If a URL is entered here, the UCS identity provider login page will contain a link to this URL.
de: Wird hier eine URL eingetragen, wird dem Benutzer ein Link zu dieser Seite auf der UCS Identity Provider-Login-Seite angezeigt.

source: Allow transmission of LDAP attributes to the service provider
de: Erlaube die Übertragung von LDAP Attributen an den Service Provider
