Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/domain-ldap.po
Languages: de

source: By default, the UCS identity provider transmits only the ``NameID`` attribute entered on the *General* page to the service provider. If additional LDAP user attributes are required by the service provider, this checkbox can be activated. The attributes that should be transmitted have to be entered in the *List of LDAP attributes to transmit*.
de: Standardmäßig überträgt der UCS Identity Provider nur das auf dem Reiter *Allgemein* angegebene ``NameID`` Attribut an den Service Provider. Benötigt der Service Provider weitere LDAP-Benutzerattribute, kann diese Checkbox aktiviert werden. Die zu übertragenen Attribute werden dann unter *Liste der zu übermittelnden LDAP Attribute* eingetragen.

source: Value for ``attribute format`` field
de: Der Wert des ``attribute format`` Feldes

source: In case the transmitted attributes need to be sent in a particular format value, this format can be entered here. Example: ``urn:oasis:names :tc:SAML:2.0:nameid-format:transient`` or ``urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified``.
de: Sollen die übertragenen Attribute mit einem besonderen Format übertragen werden, kann dieser hier eingetragen werden. Beispiel: ``urn:oasis:names:tc:SAML:2.0:nameid-format:transient`` oder ``urn:oasis:names:tc :SAML:1.1:nameid-format:unspecified``.

source: List of LDAP attributes to transmit
de: Liste der zu übermittelnden LDAP-Attribute

source: Every LDAP attribute that should be transmitted to the service provider can be entered here. Additionally, one or more service attribute names can be added to each LDAP attribute in the field next to it. These service attribute names have the purpose to translate the LDAP Attribute names for the service provider. Multiple service attribute names have to be separated by commas. In order for the UCS identity provider to process these attributes, they need to be registered additionally via the LDAP object :samp:`id=default-saml-idp,cn=univention,{[LDAP base DN]}`. LDAP attributes entered at the object can be read and transferred by the Identity Provider.
de: Hier kann jedes zu übertragende LDAP-Attribut eingetragen werden. Zu jedem dieser Attribute können ebenfalls ein oder mehrere Service Attribut-Namen im nebenstehenden Feld definiert werden. Diese dienen zur Übersetzung des LDAP Attribut-Namen für den Service-Provider. Mehrere Einträge müssen durch Kommata getrennt werden. Damit der UCS Identity Provider die angegebenen Attribute verarbeiten kann, müssen sie zusätzlich am LDAP Objekt :samp:`id=default-saml-idp,cn=univention,{[base DN]}` eingetragen werden. Dort eingetragene LDAP Attribute können vom Identity Provider ausgelesen und übertragen werden.

source: Extended Configuration
de: Erweiterte Konfiguration

source: Some environments may require the UCS Identity Provider to provide multiple logical Identity Provider instances. Logical separation is achieved by offering different URIs as Identity Provider endpoints.
de: In manchen Umgebungen kann es erforderlich sein, dass der UCS Identity Provider mehrere logische Identity Provider Instanzen bereitstellt. Die logische Trennung wird erreicht, indem der Identity Provider unterschiedliche URIs als Endpunkt anbietet.

source: The default endpoint is :samp:`https://ucs-sso.{[Domain name]}/simplesamlphp/saml2/idp/metadata.php`. Further entries can be created by setting |UCSUCRV|\ s in the form :envvar:`saml/idp/entityID/supplement/[identifier]` to ``true`` on all servers which serve the UCS Identity Provider. Typically that will be the |UCSPRIMARYDN| and all |UCSBACKUPDN|\ s. The :program:`apache2` service must then be reloaded.
de: Der standardmäßig eingerichtete Endpunkt ist :samp:`https://ucs-sso.{[domainname]}/simplesamlphp/saml2/idp/metadata.php`. Weitere Einträge können durch das Setzen von |UCSUCRV|\ n in der Form :envvar:`saml/idp/entityID/supplement/[identifier]` auf ``true`` erzeugt werden. Diese müssen auf allen Servern, die den UCS Identity Provider zur Verfügung stellen, gesetzt werden. Typischerweise sind dies der |UCSPRIMARYDN| und alle Server der Rolle |UCSBACKUPDN|. Anschließend muss der :program:`apache2` Dienst neu geladen werden.

source: For example, to set up another entry under the URI :samp:`https://ucs-sso.{[Domain name]}/simplesamlphp/{[secondIDP]}/saml2/idp/metadata.php``, the |UCSUCRV| ``saml/idp/entityID/supplement/secondIDP=true`` must be set.
de: Um beispielsweise einen weiteren Eintrag unter der URI :samp:`https://ucs-sso.{[domainname]}/simplesamlphp/{[secondIDP]}/saml2/idp/metadata.php` einzurichten, muss die |UCSUCRV| ``saml/idp/entityID/supplement/secondIDP=true`` gesetzt werden.

source: SSL certificate management
de: SSL-Zertifikatsverwaltung

source: In UCS, sensitive data are always sent across the network encrypted, e.g., via the use of SSH for the login to systems or via the use of protocols based on SSL/TLS. (*Transport Layer Security (TLS)* is the current protocol name, the name of the previous protocol *Secure Socket Layer (SSL)*, however, is still more common and is also used in this documentation).
de: Unter UCS werden sensitive Daten immer verschlüsselt über das Netzwerk übertragen, zum Beispiel durch die Verwendung von SSH für den Login auf Systeme oder durch Verwendung von Protokollen auf Basis von SSL/TLS. (*Transport Layer Security (TLS)* ist der aktuelle Protokollname, der Name des Vorgängerprotokolls *Secure Socket Layer (SSL)* ist jedoch weiterhin gebräuchlicher und wird auch in dieser Dokumentation verwendet).

source: For example, SSL/TLS is employed in the listener/notifier domain replication or for HTTPS access to |UCSWEB|\ s.
de: SSL/TLS kommt beispielsweise bei der Listener/Notifier-Domänenreplikation oder beim HTTPS-Zugriff auf |UCSWEB|\ n zum Einsatz.

source: Both communication partners must be able to verify the authenticity of the key used for encrypted communication between two computers. To this end, each computer also features a so-called *host certificate*, which is issued and signed by a certification authority (CA).
de: Für eine verschlüsselte Kommunikation zwischen zwei Rechnern müssen beide Kommunikationspartner die Authentizität des verwendeten Schlüssels prüfen können. Dafür besitzt jeder Rechner ein so genanntes *Rechnerzertifikat*, das von einer Zertifizierungsstelle (Certification Authority, CA) herausgegeben und signiert wird.

source: UCS provides its own CA, which is automatically set up during installation of the |UCSPRIMARYDN| and from which every UCS system automatically procures a certificate for itself and the CA's public certificate when joining the domain. This CA appears as the root CA, signs its own certificate and can sign certificates for other certification authorities.
de: UCS bringt seine eigene CA mit, die bei der Installation des |UCSPRIMARYDN| automatisch eingerichtet wird und von der jedes UCS-System im Rahmen des Domänenbeitritts automatisch ein Zertifikat für sich selbst und das öffentliche Zertifikat der CA bezieht. Diese CA tritt als Root-CA auf, signiert ihr eigenes Zertifikat, und kann Zertifikate für andere Zertifizierungsstellen signieren.

source: The properties of the CA are generated automatically during the installation based on system settings such as the locale. These settings can be subsequently adapted on the |UCSPRIMARYDN| in the UMC module :guilabel:`Certificate settings`.
de: Die Eigenschaften der CA werden bei der Installation basierend auf Systemeinstellungen wie der Locale automatisch festgelegt. Diese Einstellungen können auf dem |UCSPRIMARYDN| im UMC-Modul :guilabel:`Zertifikats-Einstellungen` nachträglich angepasst werden.

source: If the UCS domain contains more than one system, all other host certificates need to be reissued after changing the root certificate! The procedure required for this is documented in :uv:kb:`Renewing the SSL certificates <37>`.
de: Besteht die UCS-Domäne aus mehr als einem System, müssen durch die Änderung des Root-Zertifikats auch alle anderen Rechner-Zertifikate neu ausgestellt werden! Das dafür nötige Vorgehen ist in :uv:kb:`Renewing the SSL certificates <37>` dokumentiert.

source: The UCS-CA is always found on the |UCSPRIMARYDN|. A copy of the CA is stored on every |UCSBACKUPDN|, which is synchronized with the CA on the |UCSPRIMARYDN| by a Cron job every 20 minutes.
de: Die UCS-CA befindet sich immer auf dem |UCSPRIMARYDN|. Auf jedem |UCSBACKUPDN| wird eine Kopie der CA vorgehalten, die über einen Cronjob standardmäßig alle 20 Minuten mit der CA auf dem |UCSPRIMARYDN| synchronisiert wird.

source: The CA is synchronized from the |UCSPRIMARYDN| to the |UCSBACKUPDN| and not vice-versa. For this reason, only the CA on the |UCSPRIMARYDN| should be used.
de: Die CA wird nur vom |UCSPRIMARYDN| zum |UCSBACKUPDN| synchronisiert und nicht umgekehrt. Es sollte also ausschließlich die CA auf dem |UCSPRIMARYDN| verwendet werden.

source: If a |UCSBACKUPDN| is promoted to the |UCSPRIMARYDN| (see :ref:`domain-backup2master`), the CA on the new |UCSPRIMARYDN| can be used directly.
de: Wird ein |UCSBACKUPDN| zum |UCSPRIMARYDN| hochgestuft (siehe :ref:`domain-backup2master`), so kann die CA auf dem dann neuen |UCSPRIMARYDN| direkt verwendet werden.

source: The UCS root certificate has a specified validity period - as do the computer certificates created with it.
de: Das UCS-Root-Zertifikat hat - ebenso wie die damit erstellten Rechnerzertifikate - einen bestimmten Gültigkeitszeitraum.

source: Once this period of time elapses, services which encrypt their communication with SSL (e.g., LDAP or domain replication) no longer function.
de: Ist dieser Zeitraum abgelaufen, funktionieren Dienste, die ihre Kommunikation mit SSL verschlüsseln (z.B. LDAP oder die Domänenreplikation) nicht mehr.

source: It is thus necessary to verify the validity of the certificate regularly and to renew the root certificate in time. A Nagios plugin is provided for the monitoring of the validity period. In addition, a warning is shown when opening a UMC module if the root certificate is going to expire soon (the warning period can be specified with the |UCSUCRV| :envvar:`ssl/validity/warning`; the standard value is 30 days).
de: Es ist deshalb notwendig, die Gültigkeit der Zertifikate regelmäßig zu überprüfen und rechtzeitig das Root-Zertifikat zu erneuern. Für die Überwachung des Gültigkeitszeitraums wird ein Nagios-Plugin bereitgestellt. Außerdem erfolgt beim Öffnen eines UMC-Moduls eine Warnmeldung, wenn das Root-Zertifikat bald abläuft (der Warnzeitraum kann mit der |UCSUCRV| :envvar:`ssl/validity/warning` festgelegt werden und beträgt standardmäßig 30 Tage).

source: The renewal of the root certificate and the other host certificates is documented in :uv:kb:`Renewing the SSL certificates <37>`.
de: Die Erneuerung des Root-Zertifikats und der übrigen Rechnerzertifikate ist in :uv:kb:`Renewing the SSL certificates <37>` dokumentiert.

source: On UCS systems, a Cron job verifies the validity of the local computer certificate and the root certificate daily and records the expiry date in the |UCSUCR| variables :envvar:`ssl/validity/host` (host certificate) and :envvar:`ssl/validity/root` (root certificate). The values entered there reflect the number of days since the 1970-01-01.
de: Auf UCS-Systemen überprüft ein Cronjob täglich die Gültigkeit des lokalen Rechnerzertifikats und des Root-Zertifikats und schreibt das Ablaufdatum in die |UCSUCR|-Variablen :envvar:`ssl/validity/host` (Rechnerzertifikat) und :envvar:`ssl/validity/root` (Root-Zertifikat). Die dort angegebenen Werte spiegeln die Anzahl der Tage seit dem 1.1.1970 wieder.

source: In |UCSUMC|, the effective expiry date of the computer and root certificate can be accessed via the upper right menu and the entry :menuselection:`License --> License information`.
de: In |UCSUMC| wird das effektive Ablaufdatum des Rechner- und Root-Zertifikats angezeigt über über das rechte, obere Benutzermenü und den Menüpunkt :menuselection:`Lizenz --> Lizenzinformation`.

source: UCS system roles
de: UCS-Systemrollen

source: In a UCS domain systems can be installed in different *system roles*. The following gives a short characterization of the different systems.
de: In einer UCS-Domäne können Systeme in unterschiedlichen *Systemrollen* installiert werden. Im Folgenden werden die verschiedenen Systemrollen kurz charakterisiert.

source: A system with the |UCSPRIMARYDN| role is the primary domain controller of a UCS domain and is always installed as the first system. The domain data (such as users, groups, printers) and the SSL security certificates are saved on the |UCSPRIMARYDN|.
de: Ein System mit der Rolle |UCSPRIMARYDN| ist das führende System einer UCS-Domäne und wird immer als erstes System installiert. Auf dem |UCSPRIMARYDN| werden die Domänendaten (wie z.B. Benutzer, Gruppen, Drucker) und die SSL-Sicherheitszertifikate gespeichert.

source: Copies of these data are automatically transferred to all servers with the |UCSBACKUPDN| role.
de: Kopien dieser Daten werden automatisch auf Server mit der Rolle |UCSBACKUPDN| übertragen.

source: All the domain data and SSL security certificates are saved as read-only copies on servers with the |UCSBACKUPDN| role.
de: Auf Servern mit der Rolle |UCSBACKUPDN| werden alle Domänendaten und SSL-Sicherheitszertifikate als Nur-Lese-Kopie gespeichert.

source: The |UCSBACKUPDN| is the fallback system for the |UCSPRIMARYDN|. If the latter should fail, a |UCSBACKUPDN| can take over the role of the |UCSPRIMARYDN| permanently (see :ref:`domain-backup2master`).
de: Der |UCSBACKUPDN| dient als Ersatzsystem des |UCSPRIMARYDN|. Sollte dieser ausfallen, kann ein |UCSBACKUPDN| die Rolle des |UCSPRIMARYDN| dauerhaft übernehmen (siehe :ref:`domain-backup2master`).

source: All the domain data are saved as read-only copies on servers with the |UCSREPLICADN| role. In contrast to the |UCSBACKUPDN|, however, not all security certificates are synchronized.
de: Auf Servern mit der Rolle |UCSREPLICADN| werden die Domänendaten als Nur-Lese-Kopie gespeichert. Im Gegensatz zum |UCSBACKUPDN| werden jedoch nicht alle SSL-Sicherheitszertifikate gespeichert.

source: As access to the services running on a |UCSREPLICADN| are performed against the local LDAP server, |UCSREPLICADN|\ s are ideal for site servers and the distribution of load-intensive services.
de: Da die Zugriffe der auf einem |UCSREPLICADN| laufenden Dienste gegen den lokalen LDAP-Datenbestand erfolgen, bieten sich |UCSREPLICADN|\ s für Standortserver und für die Verteilung lastintensiver Dienste an.

source: A |UCSREPLICADN| cannot be promoted to a |UCSPRIMARYDN|.
de: Ein |UCSREPLICADN| kann nicht zum |UCSPRIMARYDN| hochgestuft werden.

source: |UCSMANAGEDNODE| are server systems without a local LDAP server. Access to domain data here is performed via other servers in the domain.
de: |UCSMANAGEDNODE| sind Server-Systeme ohne lokalen LDAP-Server. Der Zugriff auf Domänendaten erfolgt hierbei über andere Server der Domäne.

source: Ubuntu clients can be managed with this system role, see :ref:`computers-ubuntu`.
de: Ubuntu-Clients können mit einer eigenen Systemrolle verwaltet werden, siehe :ref:`computers-ubuntu`.

source: This system role is used for the integration of other Linux systems than UCS and Ubuntu, e.g., for Debian or CentOS systems. The integration is documented in :cite:t:`ext-doc-domain`.
de: Diese Systemrolle wird für die Integration von anderen Linux-Systemen als UCS und Ubuntu verwendet, z.B. für Debian- oder CentOS-Systeme. Die Integration wird in :cite:t:`ext-doc-domain` beschrieben.

source: macOS systems can be joined into a UCS domain using Samba/AD. Additional information can be found in :ref:`macos-domain-join`.
de: macOS-Systeme können einer UCS-Domäne mit Samba/AD beitreten. Weitere Hinweise finden sich in :ref:`macos-domain-join`.

source: A domain trust account is set up for trust relationships between Windows and UCS domains.
de: Ein Domain Trust Account wird für Vertrauensstellungen zwischen Windows und UCS Domänen eingerichtet.

source: An IP client allows the integration of non-UCS systems into the IP management (DNS/DHCP), e.g., for network printers or routers.
de: Ein IP-Client ermöglicht die Integration von Nicht-UCS-Systemen in das IP-Management (DNS/DHCP), z.B. für Netzwerkdrucker oder Router.

source: Windows Domaincontroller
de: Windows Domänencontroller

source: Windows domain controllers in a Samba/AD environment are operated with this system role.
de: Windows-Domänencontroller in einer Samba/AD-Umgebung werden mit dieser Systemrolle betrieben.

source: Windows clients and Windows |UCSMANAGEDNODE|\ s are managed with this system role.
de: Windows-Clients und Windows-Memberserver werden mit dieser Systemrolle verwaltet.
