Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/domain-ldap.po
Languages: de

source: Protocol of activities in the domain
de: Protokollierung von Aktivitäten in der Domäne

source: The :program:`Admin Diary` app provides the facility to log important events happening in the domain. This includes among others:
de: Über die :program:`Admin Diary` App besteht die Möglichkeit, wichtige Ereignisse in der Domäne zu protokollieren. Dazu gehören unter anderem:

source: Creation, move, modification and deletion of users and other objects using |UCSUDM|
de: Das Anlegen, Verschieben, Verändern oder Löschen von Benutzern und anderen Objekten über |UCSUDM|

source: Installation, update and deinstallation of apps
de: Installation, Update und Deinstallation von Apps

source: Server password changes
de: Server-Passwort-Änderungen

source: Start, end and eventual failures of domain joins
de: Start, Ende und eventuelle Fehler bei Domänenbeitritten

source: Start and end of UCS updates
de: Start und Ende von UCS Updates

source: View of events in Admin Diary
de: Ansicht der Ereignisse im Admin Diary

source: :numref:`domain-ldap-admindiary-list` shows, how events are shown in the UMC module :guilabel:`Admin Diary`. By default the displayed entries are grouped by week and can additionally be filtered through the search field. Selecting an entry from the list opens a dialog showing additional details about the who and when of the event, as shown in :numref:`domain-ldap-admindiary-detail`. Moreover there is the possibility to comment each event.
de: :numref:`domain-ldap-admindiary-list` zeigt, wie die Ereignisse im UMC-Modul :guilabel:`Admin Diary` dargestellt werden. Die angezeigten Einträge werden standardmäßig wochenweise gruppiert und können über das Suchfeld weiter eingegrenzt werden. Durch das Auswählen eines Eintrags gelangt man zu einer Detailansicht, wie sie in :numref:`domain-ldap-admindiary-detail` zu sehen ist. Dieser kann man weitere Details zum Wo und Wann entnehmen. Zudem besteht die Möglichkeit, das Ereignis zu kommentieren.

source: Detail view in Admin Diary
de: Detailansicht im Admin Diary

source: The app consists of two components:
de: Die App besteht aus zwei Komponenten:

source: The back end must be installed on one system in the domain before the front end can be installed. It includes a customization for :program:`rsyslog` and writes into a central database, which defaults to PostgreSQL. If MariaDB or MySQL is already installed on the target system, it will be used instead of PostgreSQL.
de: Das Backend muss auf einem System in der Domäne installiert sein, bevor das Frontend installiert werden kann. Es beinhaltet eine Anpassung für :program:`rsyslog` und schreibt in eine zentrale Datenbank, standardmäßig PostgreSQL. Falls MariaDB oder MySQL vorher auf dem Zielsystem installiert ist, dann wird es statt PostgreSQL verwendet.

source: Likewise the front end must be installed at least once, but more installations are also possible. The front end includes the UMC module :guilabel:`Admin Diary`, which is used to show and comment the entries. When installing it on a different host than where the back end is installed, access to the central database needs to be configured manually. The required steps for this are described in `Admin Diary - How to separate front end and back end <univention-kb-admin-diary-separate-frontend-backend_>`_.
de: Auch das Frontend muss mindestens einmal installiert sein, kann aber öfter installiert werden. Das Frontend beinhaltet das UMC-Modul :guilabel:`Admin Diary`, um die Einträge anzuzeigen und zu kommentieren. Wenn es nicht auf dem selben System installiert werden soll, auf dem das Backend läuft, dann muss der Zugriff auf die zentrale Datenbank manuell eingerichtet werden. Die dazu notwendigen Schritte sind in `Admin Diary - How to separate front end and back end <univention-kb-admin-diary-separate-frontend-backend_>`_ beschrieben.

source: Converting a |UCSBACKUPDN| backup to the new |UCSPRIMARYDN|
de: Umwandlung eines |UCSBACKUPDN| zum neuen |UCSPRIMARYDN|

source: A UCS domain consists of only one |UCSPRIMARYDN|, but is not limited in the number of |UCSBACKUPDN|. A |UCSBACKUPDN| stores all the domain data and all SSL security certificates as read-only copies. However, in contrast to the |UCSPRIMARYDN|, writing changes are not allowed.
de: Eine UCS Domäne hat immer genau einen |UCSPRIMARYDN|, kann aber beliebig viele |UCSBACKUPDN| beinhalten. Ein |UCSBACKUPDN| speichert alle Domänendaten und alle SSL-Sicherheitszertifikate als Kopie, im Gegensatz zum |UCSPRIMARYDN| können jedoch keine schreibenden Änderungen vorgenommen werden.

source: Any |UCSBACKUPDN| can be converted to a |UCSPRIMARYDN|. There are two typical scenarios for this:
de: Jeder |UCSBACKUPDN| kann zu einem |UCSPRIMARYDN| umgewandelt werden. Hierfür gibt es zwei typische Anwendungsfälle:

source: In an emergency if the hardware of the |UCSPRIMARYDN| fails.
de: Im Notfall nach einem Hardwareausfall des |UCSPRIMARYDN|.

source: To replace a fully functional |UCSPRIMARYDN| with new hardware or changing the architecture from *i386* to *amd64*.
de: Zum geplanten Ersetzen des |UCSPRIMARYDN| durch neue Hardware oder Wechsel der Architektur von *i386* auf *amd64*.

source: The conversion of a |UCSBACKUPDN| to a |UCSPRIMARYDN| is a serious configuration change and should be prepared carefully. The conversion cannot be reversed.
de: Die Umwandlung eines |UCSBACKUPDN| in einen |UCSPRIMARYDN| ist ein tiefgreifender Konfigurationsschritt und sollte gründlich vorbereitet werden! Die Umwandlung kann nicht rückgängig gemacht werden.

source: The |UCSPRIMARYDN| that is going to be replaced has to be shut down before the conversion. It must not be powered on during or after the conversion!
de: Der zu ersetzende |UCSPRIMARYDN| muss vor Beginn der Umwandlung abgeschaltet werden und darf weder während der Umwandlung noch im Anschluss daran wieder in Betrieb genommen werden!

source: Before the conversion, the installed software packages and the current configuration has to be compared between the |UCSPRIMARYDN| and |UCSBACKUPDN|. If the |UCSPRIMARYDN| is not available anymore, use a file backup. After the conversion, all possibly remaining references of the old |UCSPRIMARYDN| have to be removed or changed to the new |UCSPRIMARYDN|.
de: Im Vorfeld muss die installierte Software sowie die aktuelle Konfiguration zwischen |UCSPRIMARYDN| und |UCSBACKUPDN| abgeglichen werden. Wenn der |UCSPRIMARYDN| wegen eines Ausfalls nicht mehr verfügbar ist, muss eine Sicherung herangezogen werden. Im Nachgang an die Umwandlung müssen alle möglichen verbliebenen Referenzen auf den alten |UCSPRIMARYDN| entfernt oder korrigiert werden.

source: The conversion primarily involves the changeover of the services relevant for authentication such as LDAP, DNS, Kerberos and Samba. The installed software needs to be adjusted manually (this can be done using the UMC modules :guilabel:`App Center` or :guilabel:`Package Management`).
de: Die Umwandlung umfasst primär die Umstellung der für die Authentifizierung relevanten Dienste wie LDAP, DNS, Kerberos und Samba. Der Abgleich der installierten Software muss manuell erfolgen (über die UMC-Module :guilabel:`App Center` und :guilabel:`Paket-Verwaltung`).

source: For example, if the mail component was installed on the previous |UCSPRIMARYDN|, it will not be automatically installed on the new |UCSPRIMARYDN| after the conversion. To minimize manual changes after the conversion, please consider :ref:`domain-fault-tolerant`.
de: Wenn also z.B. auf dem vorherigen |UCSPRIMARYDN| die Mailkomponente installiert war, ist diese nach der Umwandlung nicht automatisch auf dem neuen |UCSPRIMARYDN| verfügbar. Um den Umfang der Nachbereitung möglichst gering zu halten, sollte im Vorfeld :ref:`domain-fault-tolerant` beachtet werden.

source: If additional LDAP schema packages were installed on the |UCSPRIMARYDN|, they must also be installed on the |UCSBACKUPDN| prior to the conversion. The package list of the old |UCSPRIMARYDN| should be saved prior to the promotion in order to allow a subsequent comparison of the installed packages. The package list can be created with the following command:
de: Wurden auf dem |UCSPRIMARYDN| zusätzliche LDAP-Schema-Pakete installiert, so müssen diese vor der Umwandlung auch auf dem |UCSBACKUPDN| installiert werden. Die Paketliste des alten |UCSPRIMARYDN| sollte vor der Umstellung gesichert werden, um einen Abgleich der installierten Pakete zu erlauben. Die Paketliste kann mit dem folgenden Befehl erstellt werden:

source: This file should be compared with the same output on the |UCSBACKUPDN|. Missing packages should then be installed on the |UCSBACKUPDN|. Especially those packages that install a LDAP schema are absolutely necessary. The following command executed on the |UCSPRIMARYDN| will list all affected packages:
de: Die so auf dem |UCSPRIMARYDN| erstellte Datei sollte mit einer ebenso erstellten Datei des |UCSBACKUPDN| verglichen und benötigte Pakete auf dem |UCSBACKUPDN| nachinstalliert werden. Insbesondere alle Pakete, die ein LDAP-Schema installieren, sind zwingend erforderlich. Eine Auflistung dieser LDAP-Schema-Pakete lässt sich wie folgt erstellen:

source: To simply install all packages of the |UCSPRIMARYDN| also on the |UCSBACKUPDN|, use the previously created file :file:`dpkg.selection` of the |UCSPRIMARYDN| and run the following command on the |UCSBACKUPDN|:
de: Um einfach alle installierten Pakete des |UCSPRIMARYDN| auch auf dem |UCSBACKUPDN| zu installieren, kann die zuvor auf dem |UCSPRIMARYDN| erstellte Datei :file:`dpkg.selection` mit folgenden Befehlen verwendet werden:

source: In addition, the |UCSUCR| inventory needs to be saved so that it is possible to compare the configuration adjustments on the new |UCSPRIMARYDN|. The following files on the |UCSPRIMARYDN| need to be compared with those on the |UCSBACKUPDN|:
de: Darüber hinaus sollte der |UCSUCR|-Datenbestand gesichert werden, um Konfigurationsanpassungen auch auf dem neuen |UCSPRIMARYDN| abgleichen zu können. Folgende Dateien des |UCSPRIMARYDN| sind dazu mit denen auf dem |UCSBACKUPDN| zu vergleichen:

source: UCS saves a copy of those files every night to :file:`/var/univention-backup/ucr-backup_%Y%m%d.tgz`.
de: Eine nächtliche Sicherung dieser Dateien findet sich auch in :file:`/var/univention-backup/ucr-backup_%Y%m%d.tgz`.

source: The conversion of a |UCSBACKUPDN| to the new |UCSPRIMARYDN| is performed by running the command :command:`/usr/lib/univention-ldap/univention-backup2master` on the |UCSBACKUPDN|. The system must be rebooted after the conversion. The process is logged to :file:`/var/log/univention/backup2master.log` The following steps are performed by :command:`univention-backup2master`:
de: Die Umwandlung eines |UCSBACKUPDN| zum neuen |UCSPRIMARYDN| erfolgt dann durch Aufruf des Befehls :command:`/usr/lib/univention-ldap/univention-backup2master` auf dem |UCSBACKUPDN|. Das System muss anschließend neu gestartet werden. Die Umstellung wird in der Logdatei :file:`/var/log/univention/backup2master.log` protokolliert. Folgende Schritte führt der Befehl :command:`univention-backup2master` der Reihe nach aus:

source: Checking the environment: The system must be a |UCSBACKUPDN| that already joined the domain. Additionally, it is checked if the |UCSPRIMARYDN| can be resolved via DNS and if the repository server can be reached. Also, the |UCSPRIMARYDN| must be powered off and not reachable anymore.
de: Prüfung der Umgebung: Bei dem System muss es sich um einen |UCSBACKUPDN| handeln, der der Domäne bereits beigetreten ist. Zudem wird sichergestellt, dass der |UCSPRIMARYDN| über DNS auflösbar sowie dass eine Verbindung zum Repository-Server möglich ist. Außerdem darf der |UCSPRIMARYDN| nicht mehr im Netzwerk erreichbar sein.

source: Now, the most important services OpenLDAP, Samba, Kerberos and |UCSUDN| and Listener will be stopped. Important |UCSUCRV|, such as :envvar:`ldap/master` and :envvar:`server/role` will be changed. The UCS Root CA certificate will be available via the web server on the |UCSBACKUPDN|. All mentioned services will be started again.
de: Nun werden die wichtigsten Dienste OpenLDAP, Samba, Kerberos sowie |UCSUDN| und Listener gestoppt, elementare |UCSUCRV| wie :envvar:`ldap/master` und :envvar:`server/role` umgestellt, das UCS Root-Zertifikat vom Webserver des |UCSBACKUPDN| abrufbar gemacht und die oben genannten Dienste wieder gestartet.

source: The DNS SRV record ``kerberos-adm`` will be changed from the old to the new |UCSPRIMARYDN|.
de: Der DNS SRV Eintrag ``kerberos-adm`` wird vom alten auf den neuen |UCSPRIMARYDN| geändert.

source: If present, the Univention S4 Connector (see :ref:`windows-s4-connector`) will be removed from the computer object of the old |UCSPRIMARYDN| and will be scheduled for re-configuration on the new |UCSPRIMARYDN|.
de: Sofern vorhanden, wird der Univention S4 Connector (siehe :ref:`windows-s4-connector`) vom Rechnerobjekt des alten |UCSPRIMARYDN| entfernt und auf dem neuen |UCSPRIMARYDN| zur erneuten Konfiguration vorgemerkt.

source: The server role of the new |UCSPRIMARYDN| will be changed to ``domaincontroller_master`` in the OpenLDAP directory service. The DNS SRV record ``_domaincontroller_master._tcp`` will also be adjusted.
de: Im OpenLDAP wird die Serverrolle des neuen |UCSPRIMARYDN| auf ``domaincontroller_master`` geändert. Ebenfalls wird der DNS SRV Eintrag ``_domaincontroller_master._tcp`` korrigiert.

source: If present, all entries of the old |UCSPRIMARYDN| will be removed from the local Samba directory service. Additionally, the FSMO roles will be transferred to the new |UCSPRIMARYDN|.
de: Sofern vorhanden werden die Einträge des alten |UCSPRIMARYDN| aus der lokalen Samba-Datenbank des neuen |UCSPRIMARYDN| entfernt. Zudem werden die FSMO-Rollen auf den neuen |UCSPRIMARYDN| übertragen.

source: The computer object of the old |UCSPRIMARYDN| will be deleted from OpenLDAP.
de: Anschließend wird das Rechnerobjekt des alten |UCSPRIMARYDN| im OpenLDAP gelöscht.

source: The OpenLDAP directory service will be searched for any remaining references to the old |UCSPRIMARYDN|. All found references (e.g. DNS records) are shown and suggested to be fixed. The suggested fixes have to be checked and confirmed one by one.
de: Nun wird das LDAP nach Referenzen auf den alten |UCSPRIMARYDN| durchsucht. Alle gefundenen Referenzen werden angezeigt und es wird eine Korrektur vorgeschlagen, welche einzeln geprüft und bestätigt werden muss, z.B. weitere DNS-Einträge.

source: Finally, the package :program:`univention-server-backup` will be replaced by :program:`univention-server-master`.
de: Zum Abschluss wird das Paket :program:`univention-server-backup` durch :program:`univention-server-master` ersetzt.

source: Subsequently, the LDAP directory on the new |UCSPRIMARYDN| and the |UCSUCR| values on all UCS systems of the domain should be checked for any remaining references to the hostname or the IP address of the old |UCSPRIMARYDN|. Those references need to be adjusted to the new |UCSPRIMARYDN|, too.
de: Im Anschluss sollte sowohl |UCSUCR| auf allen UCS-Systemen der Domäne als auch das LDAP auf dem jetzt neuen |UCSPRIMARYDN| hinsichtlich Verweisen auf den Namen und die IP-Adresse des alten |UCSPRIMARYDN| überprüft und diese angepasst werden.

source: Joining domains
de: Domänenbeitritt

source: A UCS, Ubuntu or Windows system must join the domain after installation.
de: Ein UCS, Ubuntu- oder Windows-System muss nach der Installation der Domäne beitreten.

source: In addition to UCS, Ubuntu and macOS, arbitrary Unix systems can be integrated into the domain. This is described in :cite:t:`ext-doc-domain`.
de: Neben UCS, Ubuntu und macOS können auch weitere Unix-Systeme in die Domäne integriert werden. Dies ist in :cite:t:`ext-doc-domain` beschrieben.

source: How UCS systems join domains
de: Domänenbeitritt von UCS-Systemen

source: There are three possibilities for a UCS system to join an existing domain:
de: Es gibt drei Möglichkeiten ein UCS-System einer bestehenden Domäne beitreten zu lassen:

source: Directly after installation in the Univention Installer, see :ref:`installation-domain-settings-join-ucs-domain`.
de: Direkt am Ende der Installation im Univention Installer, siehe :ref:`installation-domain-settings-join-ucs-domain`.

source: Subsequently with the command :command:`univention-join`, see :ref:`domain-ldap-subsequent-domain-joins-with-univention-join`.
de: Nachträglich mit dem Befehl :command:`univention-join`, siehe :ref:`domain-ldap-subsequent-domain-joins-with-univention-join`.

source: Using the UMC module :guilabel:`Domain join`, see :ref:`linux-domain-join-umc`.
de: Durch Verwendung des UMC Moduls :guilabel:`Domänenbeitritt`, siehe :ref:`linux-domain-join-umc`.

source: The |UCSPRIMARYDN| should always be installed at the most up-to-date release stand of the domains, as problems can arise with an outdated |UCSPRIMARYDN| when a system using the current version joins.
de: Der |UCSPRIMARYDN| sollte in der Domäne immer auf dem aktuellsten Release-Stand der installiert sein, da beim Join eines Systems in aktuellerer Version gegen einen älteren |UCSPRIMARYDN| Probleme auftreten können.

source: When a computer joins, a computer account is created, the SSL certificates are synchronized and an LDAP copy is initiated if necessary. The *join scripts* are also run at the end of the join process. These register further objects, etc., in the directory service using the software packages installed on the system (see :ref:`domain-ldap-joinscripts`).
de: Beim Beitritt eines Rechners wird für diesen ein Rechnerkonto angelegt, die SSL-Zertifikate synchronisiert und eine LDAP-Replikation angestoßen. Außerdem werden am Ende des Join-Vorgangs *Join-Skripte* ausgeführt. Diese registrieren anhand der auf dem System installierten Software-Pakete z.B. weitere Objekte im Verzeichnisdienst (siehe :ref:`domain-ldap-joinscripts`).

source: The joining of the domain is registered on the client side in the :file:`/var/log/univention/join.log` log file, which can be used for reference in error analysis. Actions run on the |UCSPRIMARYDN| are stored in the :file:`/home/<Join-Account>/.univention-server-join.log` log file.
de: Der Domänenbeitritt wird auf Client-Seite in der Logdatei :file:`/var/log/univention/join.log` aufgezeichnet, die zur Fehleranalyse herangezogen werden kann. Auf dem |UCSPRIMARYDN| ausgeführte Aktionen werden in der Logdatei :file:`/home/{Join-Account}/.univention-server-join.log` abgelegt.

source: The joining process can be repeated at any time. Systems may even be required to rejoin following certain administrative steps (such as changes to important system features on the |UCSPRIMARYDN|).
de: Der Join-Vorgang kann jederzeit wiederholt werden. Nach bestimmten administrativen Schritten (etwa nach Änderungen wichtiger Systemeigenschaften auf dem |UCSPRIMARYDN|) kann ein erneuter Beitritt der Systeme sogar zwingend erforderlich sein.

source: Subsequent domain joins with *univention-join*
de: Nachträglicher Domänenbeitritt mit *univention-join*

source: :command:`univention-join` retrieves a number of essential parameters interactively; however, it can also be configured using a number of parameters:
de: :command:`univention-join` fragt eine Reihe essentieller Parameter direkt ab, ist aber auch durch mehrere Parameter konfigurierbar:

source: The |UCSPRIMARYDN| is usually detected via a DNS request. If that is not possible (e.g., a |UCSREPLICADN| server with a different DNS domain is set to join), the computer name of the |UCSPRIMARYDN| can also be entered directly using the ``-dcname HOSTNAME`` parameter. The computer name must then be entered as a fully qualified name, e.g., ``primary.company.com``.
de: Der |UCSPRIMARYDN| wird im Regelfall durch eine DNS-Abfrage ermittelt. Wenn das nicht möglich sein sollte (z.B. weil ein Standortserver mit einer abweichenden DNS-Domäne beitreten soll), lässt sich der Rechnername des |UCSPRIMARYDN| den Parameter :samp:`-dcname {HOSTNAME}` direkt angegeben werden. Der Rechnername muss dabei als vollqualifizierter Name angeben werden, also beispielsweise ``primary.firma.de``.

source: A user account which is authorized to add systems to the UCS domains is called a join account. By default, this is the ``Administrator`` user or a member of the two groups ``Domain Admins`` and ``DC Backup Hosts``. The join account can be assigned using the ``-dcaccount ACCOUNTNAME`` parameter.
de: Als Join-Account wird ein Benutzerkonto bezeichnet, das berechtigt ist, Systeme der UCS-Domäne hinzuzufügen. Standardmäßig ist dies der Benutzer ``Administrator`` oder ein Mitglied der beiden Gruppen ``Domain Admins`` und ``DC Backup Hosts``. Der Join-Account kann durch den Parameter :samp:`-dcaccount {ACCOUNTNAME}` übergeben werden.

source: The password can be set using the ``-dcpwd FILE`` parameter. The password is then read out of the specified file.
de: Das Passwort kann durch den Parameter :samp:`-dcpwd {DATEI}` übergeben werden. Das Passwort wird dabei aus der angegebenen Datei ausgelesen.

source: The ``-verbose`` parameter is used to add additional debug output to the log files, which simplify the analysis in case of errors.
de: Mit dem Parameter ``-verbose`` werden zusätzliche Debugausgaben in die Logdateien geschrieben, die die Analyse im Fehlerfall vereinfachen.

source: Joining domains via |UCSUMC| module
de: Domänenbeitritt über |UCSUMC| Modul

source: A domain join can also be carried out web based via the UMC module :guilabel:`Domain join`. As the *Administrator* user does not yet exist on a system which has yet to join the domain, the login to the module is done as user ``root``.
de: Der Domänenbeitritt kann auch webbasiert über das UMC-Modul :guilabel:`Domänenbeitritt` erfolgen. Da auf einem noch nicht der Domäne beigetretenen System der Administrator-Benutzer noch nicht vorhanden ist, muss die Anmeldung am Modul als Benutzer ``root`` erfolgen.

source: As for the :ref:`domain joining procedure via the command line <domain-ldap-subsequent-domain-joins-with-univention-join>`, username and password of a user account authorized to add computers to a domain must be entered in the resulting dialogue. Likewise, the |UCSPRIMARYDN| will be determined automatically via a DNS request, but can also be entered manually.
de: Wie bei der :ref:`Durchführung über die Kommandozeile sind für Domänenbeitritt <domain-ldap-subsequent-domain-joins-with-univention-join>` Benutzername und Passwort eines Benutzers notwendig, der berechtigt ist, Rechner der Domäne hinzuzufügen. Ebenfalls wird der |UCSPRIMARYDN| über eine DNS-Abfrage automatisch ermittelt, kann aber auch explizit im angezeigten Dialogfeld eingetragen werden.

source: The :guilabel:`Rejoin` option can be used to repeat the domain join at any time.
de: Mit der Option :guilabel:`Erneut beitreten` kann der Domänenbeitritt jederzeit erneut durchgeführt werden.

source: Join scripts / Unjoin scripts
de: Join-Skripte / Unjoin-Skripte

source: *Join scripts* are run during the domain join. Examples for changes made by join scripts are the registration of a print server in the domain or the adaptation of DNS entries. Join scripts are components of the individual software packages. In the same way, there are also *unjoin scripts*, which can reset these changes following deinstallation of software components.
de: *Join-Skripte* werden während des Domänenbeitritts aufgerufen. Beispiele für von Join-Skripten vorgenommene Änderungen sind die Registrierung eines Druckservers in der Domäne oder die Anpassung von DNS-Einträgen. Die Skripte sind Bestandteil der einzelnen Softwarepakete. Analog dazu gibt es *Unjoin-Skripte*, die nach der Deinstallation einer Softwarekomponente diese Änderungen wieder rückgängig machen.
