Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/domain-ldap.po
Languages: de

source: Password resets via the password group can be prevented for sensitive users or groups (e.g., domain administrators). The |UCSUCR| variables :envvar:`ldap/acl/user/passwordreset/protected/uid` and :envvar:`ldap/acl/user/passwordreset/protected/gid` can be used to configure users and groups. Multiple values must be separated by commas. After changes to the variables, it is necessary to restart the LDAP server using the :command:`systemctl restart slapd` command. By default the members of the ``Domain Admins`` group are protected against having theirs password changed.
de: Das Zurücksetzen der Passwörter durch die Passwort-Gruppe kann für sensible Benutzer oder Gruppen (z.B. Domänen-Administratoren) verhindert werden. Mit den |UCSUCR|-Variablen :envvar:`ldap/acl/user/passwordreset/protected/uid` und :envvar:`ldap/acl/user/passwordreset/protected/gid` können Benutzer und Gruppen konfiguriert werden. Mehrere Werte müssen durch Kommas getrennt werden. Nach Änderungen an den Variable ist es erforderlich, den LDAP-Server über den Befehl :command:`systemctl restart slapd` neu zu starten. In der Standardeinstellung werden die Mitglieder der Gruppe ``Domain Admins`` vor Passwortänderungen geschützt.

source: If access to additional LDAP attributes should be necessary for changing the password, the attribute names can be expanded in |UCSUCRV| :envvar:`ldap/acl/user/passwordreset/attributes`. After the change, the LDAP directory service must be restarted for the change to take effect. This variable is already set appropriately for a UCS standard installation.
de: Sollte für die Änderung des Passworts der Zugriff auf zusätzliche LDAP-Attribute notwendig sein, können die Attributnamen in der |UCSUCRV| :envvar:`ldap/acl/user/passwordreset/attributes` ergänzt werden. Nach der Änderung ist zur Übernahme ein Neustart des LDAP-Verzeichnisdienstes notwendig. Für eine UCS-Standard-Installation ist diese Variable bereits passend gesetzt.

source: Name Service Switch / LDAP NSS module
de: Name Service Switch / LDAP-NSS-Modul

source: With the *Name Service Switch*, the GNU C standard library (:program:`glibc`) used in Univention Corporate Server offers a modular interface for resolving the names of users, groups and hosts.
de: Die in Univention Corporate Server verwendete GNU C-Standardbibliothek (:program:`glibc`) bietet eine modulare Schnittstelle zur Auflösung von Namen von Benutzern, Gruppen und Rechnern, den *Name Service Switch*.

source: The LDAP NSS module is used on UCS systems for access to the domain data (e.g., users) as standard. The module queries the LDAP server specified in the |UCSUCRV| :envvar:`ldap/server/name` (and if necessary the :envvar:`ldap/server/addition`).
de: Das LDAP-NSS-Modul wird auf UCS-Systemen standardmäßig für den Zugriff auf die Domänen-Daten (z.B. Benutzer) verwendet. Das Modul greift dabei auf den in der |UCSUCRV| :envvar:`ldap/server/name` (und falls nötig zusätzlich der :envvar:`ldap/server/addition`) festgelegten LDAP-Server zu.

source: What measures should be taken if the LDAP server cannot be reached can be specified by the |UCSUCRV| :envvar:`nssldap/bindpolicy`. As standard, if the server cannot be reached, a new connection attempt is made. If the variable is set to ``soft``, then no new attempt is made to connect. This can considerably accelerate the boot of a system if the LDAP server cannot be reached, e.g., in an isolated test environment.
de: Das Verhalten bei nicht erreichbarem LDAP-Server kann durch die |UCSUCRV| :envvar:`nssldap/bindpolicy` festgelegt werden. Standardmäßig wird bei nicht erreichbarem Server eine erneute Verbindung aufgebaut. Wird die Variable auf ``soft`` gesetzt, wird kein erneuter Verbindungsaufbau durchgeführt. Dies kann den Boot eines Systems mit nicht erreichbarem LDAP-Server - z.B. in einer abgeschottenen Testumgebung - deutlich beschleunigen.

source: Syncrepl for synchronization with non-UCS OpenLDAP servers
de: Syncrepl zur Anbindung von Nicht-UCS OpenLDAP-Servern

source: The syncrepl replication service can also be activated parallel to the notifier service for the synchronization of OpenLDAP servers not installed on UCS systems. Syncrepl is a component of OpenLDAP, monitors changes in the local directory service and transmits them to other OpenLDAP servers.
de: Für die Anbindung von nicht auf UCS-Systemen installierten OpenLDAP-Servern an das UCS-Managementsystem kann parallel zum Notifier-Dienst der Syncrepl-Replikationsdienst aktiviert werden. Dieser ist Bestandteil von OpenLDAP, registriert Veränderungen im lokalen Verzeichnisdienst und überträgt diese auf weitere OpenLDAP-Server.

source: Configuration of the directory service when using Samba/AD
de: Konfiguration des Verzeichnis-Dienstes bei Verwendung von Samba/AD

source: As standard, the OpenLDAP server is configured in such a way that it also accepts requests from ports ``7389`` and ``7636`` in addition to the standard ports ``389`` and ``636``.
de: Standardmäßig ist der OpenLDAP-Server so konfiguriert, dass er zusätzlich zu den Standard-Ports ``389`` und ``636`` auch auf den Ports ``7389`` und ``7636`` Anfragen entgegen nimmt.

source: If Samba/AD is used, the Samba/AD domain controller service occupies the ports ``389`` and ``636``. In this case, OpenLDAP is automatically reconfigured so that only ports ``7389`` and ``7636`` are used. This must be taken into account during the configuration of syncrepl in particular (see :ref:`domain-ldap-syncrepl`). :command:`univention-ldapsearch` uses the standard port automatically.
de: Wird Samba/AD eingesetzt, belegt der Dienst Samba/AD-Domänencontroller die Ports ``389`` und ``636``. In diesem Fall wird OpenLDAP automatisch umkonfiguriert, so dass nur noch die Ports ``7389`` und ``7636`` eingesetzt werden. Dies ist insbesondere bei der Konfiguration von syncrepl zu beachten (siehe :ref:`domain-ldap-syncrepl`). :command:`univention-ldapsearch` verwendet automatisch den Standard-Port.

source: Daily backup of LDAP data
de: Tägliche Sicherung der LDAP-Daten

source: The content of the LDAP directory is backed up daily on the |UCSPRIMARYDN| and all |UCSBACKUPDN| systems via a Cron job. If Samba 4 is used, its data directory is also backed up.
de: Auf dem |UCSPRIMARYDN| und allen |UCSBACKUPDN|\ s wird der Inhalt des LDAP-Verzeichnisses durch einen Cron-Job täglich gesichert. Falls Samba 4 eingesetzt wird, werden auch dessen Daten-Verzeichnis gesichert.

source: The LDAP data are stored in the :file:`/var/univention-backup/` directory in the naming scheme :file:`ldap-backup_DATE.ldif.gz` in LDIF format. They can only be read by the ``root`` user. The Samba 4 files are stored in the directory :file:`/var/univention-backup/samba/`.
de: Die LDAP-Daten werden im LDIF-Format im Verzeichnis :file:`/var/univention-backup/` im Namensschema :file:`ldap-backup_DATUM.ldif.gz` gespeichert. Sie sind nur für den Benutzer ``root`` lesbar. Die Samba 4 Backup-Dateien werden im Verzeichnis :file:`/var/univention-backup/samba/` gesichert.

source: The |UCSUCRV| :envvar:`backup/clean/max_age` can be used to define how long old backup files are kept (e.g. ``backup/clean/max_age=365``, all files older than ``365`` days are automatically deleted). For new installations (from UCS 4.4-7 on) the default for this variable is ``365`` (days). If the variable is not set, no backup files are deleted.
de: Mit der |UCSUCRV| :envvar:`backup/clean/max_age` kann definiert werden, wie lange alte Backup-Dateien aufgehoben werden (z.B. ``backup/clean/max_age=365``, alle Dateien älter als ``365`` Tage werden automatisch gelöscht). Diese Variable wird bei Neuinstallationen ab UCS 4.4-7 automatisch auf ``365`` gesetzt. Falls die Variable nicht gesetzt ist, werden keine Backup-Dateien gelöscht.

source: Listener/notifier domain replication
de: Listener/Notifier-Domänenreplikation

source: Listener/notifier replication workflow
de: Ablauf der Listener/Notifier-Replikation

source: Replication of the directory data within a UCS domain occurs via the |UCSUDL|/Notifier mechanism:
de: Die Replikation der Verzeichnisdaten innerhalb einer UCS-Domäne erfolgt über den |UCSUDL|/Notifier-Mechanismus:

source: The |UCSUDL| service runs on all UCS systems.
de: Der |UCSUDL|-Dienst läuft auf jedem UCS-System.

source: On the |UCSPRIMARYDN| (and possibly existing |UCSBACKUPDN| systems) the |UCSUDN| service monitors changes in the LDAP directory and makes the selected changes available to the |UCSUDL| services on the other UCS systems.
de: Auf dem |UCSPRIMARYDN| (und eventuell vorhandenen |UCSBACKUPDN|\ s) überwacht der |UCSUDN|-Dienst Änderungen im LDAP-Verzeichnis und stellt die aufgezeichneten Änderungen transaktionsbasiert den |UCSUDL|-Diensten auf den weiteren UCS-Systemen zur Verfügung.

source: Listener/Notifier mechanism
de: Listener/Notifier-Mechanismus

source: The active |UCSUDL| instances in the domain connect to a |UCSUDN| service. If an LDAP change is performed on the |UCSPRIMARYDN| (all other LDAP servers in the domain are read-only), this is registered by the |UCSUDN| and notified to the listener instances.
de: Die aktiven |UCSUDL|-Instanzen der Domäne verbinden sich zu einem |UCSUDN|-Dienst. Wird auf dem |UCSPRIMARYDN| eine LDAP-Änderung durchgeführt (alle anderen LDAP-Server der Domäne sind nur lesend), wird diese durch den |UCSUDN| registriert und an die Listener-Instanzen gemeldet.

source: Each |UCSUDL| instance uses a range of |UCSUDL| modules. These modules are shipped by the installed applications; the print server package includes, for example, listener modules which generate the CUPS configuration.
de: Jede |UCSUDL|-Instanz verwendet eine Reihe von |UCSUDL|-Modulen. Diese Module werden von den installierten Applikationen mitgeliefert, das Druckserver-Paket bringt z.B Listener-Module mit, die die CUPS-Konfiguration erzeugen.

source: |UCSUDL| modules can be used to communicate domain changes to services which are not LDAP-compatible. The print server CUPS is an example of this: The printer definitions are not read from the LDAP, but instead from the :file:`/etc/cups/printers.conf` file. Now, if a printer is saved in the UMC printer management, it is stored in the LDAP directory. This change is detected by the |UCSUDL| module *cups-printers* and an entry added to, modified or deleted in :file:`/etc/cups/printers.conf` based on the data in the LDAP.
de: Durch |UCSUDL|-Module können Änderungen an der Domäne auch an Dienste übermittelt werden, die selbst nicht LDAP-fähig sind. Ein Beispiel ist der Druckserver CUPS: Die Druckerdefinitionen werden nicht aus dem LDAP ausgelesen, sondern aus der Datei :file:`/etc/cups/printers.conf`. Wird nun im UMC-Modul :guilabel:`Drucker` ein Drucker angelegt, wird dieser im LDAP registriert. Diese Änderung wird dann vom |UCSUDL|-Modul *cups-printers* erkannt und basierend auf den Daten im LDAP ein Eintrag in :file:`/etc/cups/printers.conf` hinzugefügt, modifiziert oder gelöscht.

source: Additional information on the setup of |UCSUDL| modules and developing your own modules can be found in :cite:t:`developer-reference`.
de: Weitergehende Informationen zum Aufbau von |UCSUDL|-Modulen und zur Entwicklung eigener Module finden sich in :cite:t:`developer-reference`.

source: LDAP replication is also performed by a listener module. If the LDAP server to be replicated to is not accessible, the LDAP changes are temporarily stored in the :file:`/var/lib/univention-directory-replication/failed.ldif` file. The contents of the file are automatically transferred to the LDAP when the LDAP server is available again.
de: Die LDAP-Replikation erfolgt ebenfalls durch ein Listener-Modul. Ist der LDAP-Server zu dem repliziert werden soll nicht erreichbar, werden die LDAP-Änderungen in der Datei :file:`/var/lib/univention-directory-replication/failed.ldif` zwischengespeichert. Der Inhalt dieser Datei wird beim späteren Start des LDAP-Servers automatisch in das LDAP übertragen.

source: The listener/notifier mechanism works based on transactions. A transaction ID is increased for every change in the LDAP directory of the |UCSPRIMARYDN|. A |UCSUDL| instance which has missed several transactions - for example, because the computer was switched off - automatically requests all the missing transactions once the connection is available again until its local transaction ID corresponds to that of the |UCSPRIMARYDN|.
de: Der Listener/Notifier-Mechanismus arbeitet transaktionsbasiert. Für jede Änderung im LDAP-Verzeichnis des |UCSPRIMARYDN| wird eine Transaktions-ID erhöht. Eine |UCSUDL|-Instanz, die mehrere Transaktionen verpasst hat - weil zum Beispiel der Rechner ausgeschaltet war - fragt bei erneuter Verfügbarkeit der Verbindung automatisch alle fehlenden Transaktionen ab, bis seine lokale Transaktions-ID der des |UCSPRIMARYDN| entspricht.

source: Analysis of listener/notifier problems
de: Analyse von Listener/Notifier-Problemen

source: Log files/debug level of replication
de: Logdateien/Debug-Level der Replikation

source: All status messages from the |UCSUDL| and the executed listener modules are logged in the :file:`/var/log/univention/listener.log` file. The level of detail of the log messages can be configured using the |UCSUCRV| :envvar:`listener/debug/level`.
de: Alle Statusmeldungen des |UCSUDL| und der aufgerufenen Listener-Module werden in die Datei :file:`/var/log/univention/listener.log` protokolliert. Der Detailgrad der Logmeldungen kann über die |UCSUCRV| :envvar:`listener/debug/level` konfiguriert werden.

source: Status messages from the |UCSUDN| service are logged in the :file:`/var/log/univention/notifier.log` file. The debug level can be configured using the :envvar:`notifier/debug/level`.
de: Statusmeldungen des |UCSUDN|-Dienstes werden in die Datei :file:`/var/log/univention/notifier.log` protokolliert. Der Debuglevel kann mit der Variable :envvar:`notifier/debug/level` konfiguriert werden.

source: Identification of replication problems
de: Erkennung von Replikationsproblemen

source: When the domain replication is running normally (normal system load, no network problems), the delay between changes being made in UMC modules and these changes being replicated to, for example, a |UCSREPLICADN| is barely noticeable. An incomplete replication can be identified by comparing the transaction IDs of the listener and notifier services.
de: Im Regelbetrieb der Domänenreplikation (keine hohe Last auf den Systemen, keine Störungen im Netzwerk) ist die Verzögerung zwischen Änderungen in UMC-Modulen bis zur Replikation auf z.B. eines |UCSREPLICADN| kaum merkbar. Eine möglicherweise unvollständige Replikation kann durch einen Vergleich der Transaktions-IDs von Listener- und Notifier-Dienst identifiziert werden.

source: The transactions registered by the notifier service are written in the :file:`/var/lib/univention-ldap/notify/transaction` file in ascending order on the |UCSPRIMARYDN|. An example:
de: Auf dem |UCSPRIMARYDN| werden die vom Notifier-Dienst registrierten Transaktionen in aufsteigender Reihenfolge in die Datei :file:`/var/lib/univention-ldap/notify/transaction` geschrieben. Ein Beispiel:

source: The last transaction received by the listener system is stored in the :file:`/var/lib/univention-directory-listener/notifier_id` file:
de: Auf dem Listener-System wird die zuletzt vom Listener empfangene Transaktion in der Datei :file:`/var/lib/univention-directory-listener/notifier_id` gespeichert:

source: This check can also be performed automatically by the Nagios service ``UNIVENTION_REPLICATION`` (see :ref:`nagios-preconfigured-checks`).
de: Diese Prüfung kann auch automatisiert durch den Nagios-Dienst ``UNIVENTION_REPLICATION`` durchgeführt werden (siehe :ref:`nagios-preconfigured-checks`).

source: Reinitialization of listener modules
de: Neuinitialiisierung von Listener-Modulen

source: If there are problems in running a listener module, there is the option to reinitialize the module. In this case, all LDAP objects with which the listener module works are passed on again.
de: Falls es zu Problemen bei der Abarbeitung eines Listener-Moduls gekommen ist, besteht die Möglichkeit, das Modul neu zu initialisieren. Dabei werden alle LDAP-Objekte mit denen das Listener-Modul arbeitet erneut übergeben.

source: This is a destructive operation. It removes some internal state of the listener. Use with care!
de: Dies ist eine destruktive Operation. Sie entfernt internen Zustand des Listeners. Nur mit Vorsicht verwenden!

source: The name of the listener module must be supplied to the command for the renewed initialization. The installed listener modules can be found in the :file:`/var/lib/univention-directory-listener/handlers/` directory.
de: Dem Befehl zum erneuten Initialisieren muss der Name des Listener-Moduls übergeben werden. Die installierten Listener-Module sind im Verzeichnis :file:`/var/lib/univention-directory-listener/handlers/` zu finden.

source: The following command can be used to reinitialize the printer module, for example:
de: Mit dem folgenden Befehl kann beispielsweise das Druckermodul neu initialisiert werden:

source: UCS offers the possibility to install a *OpenID Connect Provider*, which allows external web services to delegate the user login via the *OpenID Connect (OIDC)* protocol to the UCS Identity Management. The :program:`OpenID Connect Provider` App can be installed via the App Center. The service is provided by the software :program:`Kopano Konnect`.
de: UCS bietet die Möglichkeit, einen *OpenID Connect Provider* zu installieren, mit dessen Hilfe externe Web-Dienste die Benutzeranmeldung über das *OpenID Connect (OIDC)* Protokoll an das UCS Identity Management delegieren können. Die :program:`OpenID Connect Provider` App kann über das App Center installiert werden. Der Dienst wird von der Software :program:`Kopano Konnect` bereitgestellt.

source: The app can be installed on all system roles. When installing on a UCS system with the role |UCSPRIMARYDN| or |UCSBACKUPDN| the :program:`OpenID Connect Provider` is made available under the DNS entry for the single sign-on, normally this is :samp:`ucs-sso.{Domain name}`.
de: Die App kann grundsätzlich auf allen Systemrollen installiert werden. Bei einer Installation auf einem UCS System der Rolle |UCSPRIMARYDN| oder |UCSBACKUPDN| wird der :program:`OpenID Connect Provider` unter dem DNS Eintrag für den *Single Sign-On* verfügbar gemacht, im Normalfall ist dies :samp:`ucs-sso.{domain.name}`.

source: If the app is installed on a different system role, the provider can be reached directly via the hostname instead. It should be ensured that the app is installed on all other servers that are reachable at the ``ucs-sso`` DNS CNAME.
de: Wird die App auf einer anderen Systemrolle installiert, kann der Provider statt dessen direkt über den Hostnamen erreicht werden. Es sollte sichergestellt werden, dass die App auf allen Servern installiert ist, die unter dem ``ucs-sso`` DNS CNAME erreichbar sind.

source: Session synchronization between multiple installed OIDC Providers in a domain is not preconfigured. When experiencing login issues with Apps, we recommend to only install the OIDC Provider on one system, and restrict the ``ucs-sso`` DNS CNAME to that system, or contact Univention Support.
de: Die Synchronisation von Session Informationen zwischen mehreren Instanzen des OIDC Providers ist nicht vorkonfiguriert. Wenn Login Probleme bei Apps in dieser Konfiguration auftreten, empfehlen wir den OIDC Provider nur auf einem System zu betreiben, und den ``ucs-sso`` DNS CNAME auf dieses System zu beschränken, oder den Univention Support zu kontaktieren.

source: External Web services can be connected to UCS via :program:`OpenID Connect` by creating a specific object of type ``oidc/rpservice`` for this service in the UCS directory service. These can be created via the UMC module :guilabel:`LDAP directory` in the container ``cn=oidc``, which is located below the container ``cn=univention``. Here the new service can be registered via the item Add and the selection *OpenID Connect Relying Party Service*.
de: Um externe Web-Dienste per :program:`OpenID Connect` an UCS anzubinden, muss für diesen Dienst ein bestimmtes Objekt des Typs ``oidc/rpservice`` im UCS Verzeichnisdienst vorhanden sein. Dies kann im UMC-Modul :guilabel:`LDAP-Verzeichnis` im Container ``cn=oidc`` angelegt werden, der sich unterhalb des Containers ``cn=univention`` befindet. Hier kann über die Schaltfläche :guilabel:`Hinzufügen` und die Auswahl *OpenID Connect Relying Party Service* ein neuer Dienst registriert werden.

source: The same is also possible from the command line:
de: Das gleiche ist auch über die Kommandozeile möglich:

source: $ udm oidc/rpservice create --set name=$UCS_internal_identifier \ --position="cn=oidc,cn=univention,$(ucr get ldap/base)" \ --set clientid="$ClientID" \ --set clientsecret="$a_long_password" \ --set trusted=yes \ --set applicationtype=web \ --set redirectURI="$URL_from_services_documentation"
de: $ udm oidc/rpservice create --set name=$UCS_interner_Bezeichner> \ --position="cn=oidc,cn=univention,$(ucr get ldap/base)" \ --set clientid="$ClientID" \ --set clientsecret="$ein_langes_Passwort" \ --set trusted=yes \ --set applicationtype=web \ --set redirectURI="$URL_aus_der_Dokumentation_des_Dienstes"

source: The command parameters are:
de: Die Parameter des Aufrufs sind:

source: the service name displayed in the web interface during login.
de: der beim Login im Webinterface angezeigte Dienstname.

source: must be identical here and in the connected service (*shared secret*).
de: müssen hier und beim angebundenen Dienst identisch sein (*shared secret*).

source: should be set to ``yes`` by default. Otherwise, the user will be prompted for confirmation to transfer their user attributes to the service.
de: sollte standardmäßig auf ``yes`` gesetzt werden. Andernfalls wird dem Benutzer eine Bitte um Bestätigung zur Übertragung seiner Benutzerattribute an den Dienst angezeigt.

source: should be set to ``web`` for internet services.
de: sollte für Internetdienste auf den Wert ``web`` gesetzt werden.

source: URL of the login endpoint, which can be found in the documentation of the connected service. If a service is accessible via several URLs or should it also be accessible via IP address, all possible addresses must be added to the ``redirectURI`` attribute. The field can therefore be defined multiple times, whereby each individual value must contain a valid URL.
de: URL des Login-Endpunkts, die in der Dokumentation des jeweiligen angebundenen Dienstes zu finden ist. Ist ein Dienst über mehrere URLs erreichbar oder soll er auch per IP Adresse aufrufbar sein, müssen alle möglichen Adressen zum Attribut ``redirectURI`` hinzugefügt werden. Das Feld kann daher mehrfach definiert werden, wobei jeder einzelne Wert eine gültige URL enthalten muss.

source: The connected web service still needs information about the *OpenID Connect* endpoints of the provider app for its configuration. If the provider app is installed, this information can be found at the URL :samp:`https://ucs-sso{[Domain name]}/.well-known/openid-configuration`. If the provider app was installed on a system other than |UCSPRIMARYDN| or |UCSBACKUPDN|, use the FQDN of the respective server instead of :samp:`ucs-sso.{Domain name}` as described above.
de: Der angebundene Web-Dienst braucht für seine Konfiguration noch Informationen über die *OpenID Connect* Endpunkte der Provider-App. Diese sind bei installierter Provider-App unter der URL :samp:`https://ucs-sso.{[Domain Name]}/.well-known/openid-configuration` einsehbar. Wurde die Provider-App auf einem anderen System als |UCSPRIMARYDN| oder |UCSBACKUPDN| installiert, ist wie oben beschrieben statt :samp:`ucs-sso.{Domain Name}` der FQDN des jeweiligen Servers zu verwenden.
