Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/domain-ldap.po
Languages: de

source: Join scripts are stored in the :file:`/usr/lib/univention-install/` directory and unjoin scripts in :file:`/usr/lib/univention-uninstall/`. Each join/unjoin script has a version. An example: A package has already been installed and the join script already run. The new version of the package now requires additional changes and the version number of the join script is increased.
de: Join-Skripte werden im Verzeichnis :file:`/usr/lib/univention-install/` und Unjoin-Skripte in :file:`/usr/lib/univention-uninstall/` gespeichert. Jedes Join/Unjoin-Skript verfügt über eine Version. Ein Beispiel: Ein Paket ist bereits installiert und das Join-Skript schon aufgerufen. In der neuen Version des Pakets sind nun zusätzliche Änderungen nötig und die Versionsnummer des Join-Skripts wird erhöht.

source: The :command:`univention-check-join-status` command can be used to check whether join/unjoin scripts need to be run (either because they have yet to be run or an older version was run).
de: Mit dem Befehl :command:`univention-check-join-status` kann geprüft werden, ob Join- oder Unjoin-Skripte aufgerufen werden müssen (entweder weil sie noch nie oder in einer älteren Version aufgerufen wurde).

source: Subsequent running of join scripts
de: Nachträgliches Ausführen von Join-/Unjoin-Skripten

source: If there are join/unjoin scripts on a system which have not yet been run or which can only be run for an older version, a warning message is shown upon opening a UMC module.
de: Gibt es auf einem System Join- oder Unjoin-Skripte, die noch nicht ausgeführt wurden oder die nur für eine ältere Version ausgeführt wurden, wird beim Öffnen eines UMC-Moduls eine Warnmeldung ausgegeben.

source: Join scripts that have not been run can be executed via the UMC module :guilabel:`Domain join` by clicking on the menu entry :guilabel:`Execute all pending join scripts`.
de: Nicht ausgeführte Join-Skripte können über das UMC-Modul :guilabel:`Domänenbeitritt` aufgerufen werden, in dem der Menüpunkt :guilabel:`Alle Skripte ausführen` aufgerufen wird.

source: The :command:`univention-run-join-scripts` command is used to run all of the join/unjoin scripts installed on a system. The scripts check automatically whether they have already been executed.
de: Mit dem Befehl :command:`univention-run-join-scripts` lassen sich alle auf einem System installierten Join-/Unjoin-Skripte ausführen. Ob sie bereits gestartet wurden, prüfen die Skripte selbständig.

source: The name of the join/unjoin script and the output of the script are also recorded in :file:`/var/log/univention/join.log`.
de: Der Name des Join/Unjoin-Skripts und die Skriptausgabe werden auch in :file:`/var/log/univention/join.log` festgehalten.

source: If :command:`univention-run-join-scripts` is run on another system role than the |UCSPRIMARYDN|, the user will be asked to input a username and password. This can be performed on the |UCSPRIMARYDN| via the ``--ask-pass`` option.
de: Wird :command:`univention-run-join-scripts` auf einer anderen Systemrolle als |UCSPRIMARYDN| ausgeführt, so wird der Benutzer nach einem Benutzernamen und einem Passwort gefragt. Auf dem |UCSPRIMARYDN| kann dies durch die Option ``--ask-pass`` erreicht werden.

source: Windows domain joins
de: Windows-Domänenbeitritt

source: The procedure for joining a Windows system to a UCS domain made available via Samba is now described as an example for Windows 11, Windows 10 and Windows 2012 / 2016 / 2019. The process is similar for other Windows versions. In addition to the client versions, Windows server systems can also join the domain. Windows servers join the domain as member servers; joining a Windows systems as a domain controller is not supported. For more information about Windows in a UCS domain, refer to :ref:`windows-services-for-windows`.
de: Der Domänenbeitritt von Microsoft Windows-Systemen zu einer durch Samba bereitgestellten UCS-Domäne wird nachfolgend für Windows 11, Windows 10 und Windows 2012 / 2016 / 2019 beispielhaft beschrieben. Bei anderen Windows-Versionen funktioniert der Beitritt ähnlich. Neben den Client-Versionen können auch Windows Server-Systeme der Domäne beitreten. Windows-Server treten der Domäne als Memberserver bei. Ein Beitritt eines Windows-Systems als Domänencontroller wird nicht unterstützt. Weitere Informationen zu Windows in einer UCS-Domäne finden Sie unter :ref:`windows-services-for-windows`.

source: Only domain-compatible Windows versions can join the UCS domain, i.e., it is not possible for the Home versions of Windows to join a domain.
de: Nur domänenfähige Windows-Versionen können der UCS-Domäne beitreten, d.h. ein Domänenbeitritt mit den Home-Versionen von Windows ist nicht möglich.

source: A host account is created for the Windows client automatically when it joins the domain (see :ref:`computers-hostaccounts`). Information concerning MAC and IP addresses, the network, DHCP or DNS can be configured via UMC modules prior to or after joining the domain.
de: Beim Domänenbeitritt wird automatisch ein Rechnerkonto für den Windows-Client erstellt (siehe :ref:`computers-hostaccounts`). Angaben zu MAC- und IP-Adresse, Netzwerk, DHCP oder DNS können vor oder nach dem Domänenbeitritt durch UMC-Module ergänzt werden.

source: Domain joining is usually performed with the local Administrator account on the Windows system.
de: Der Domänenbeitritt wird in der Regel mit dem lokalen Administrator-Konto des Windows-Systems durchgeführt.

source: Joining the domain takes some time and the process must not be canceled prematurely. After successful joining a small window appears with the message *Welcome to the domain <your domain name>*. This should be confirmed with :guilabel:`OK`. The computer must then be restarted for the changes to take effect.
de: Der Domänenbeitritt dauert einige Zeit und sollte nicht vorzeitig abgebrochen werden. Nach einem erfolgreichen Beitritt erscheint ein kleines Fenster mit der Nachricht *Willkommen in der Domäne <Name Ihrer Domain>*, die mit :guilabel:`OK` bestätigt werden muss. Abschließend muss der Rechner neu gestartet werden, um die Änderungen in Kraft zu setzen.

source: Domain names must be limited to 13 characters as they are otherwise truncated at the Windows client and this can lead to sign in errors.
de: Domänennamen sollten auf 13 Zeichen beschränkt werden, da diese auf Seite der Windows-Clients ansonsten verkürzt dargestellt werden, was zu Anmeldefehlern führen kann.

source: For a domain join against a domain controller based on Samba/AD, the DNS configuration of the client must be set up in such a way that DNS entries from the DNS zone of the UCS domain can also be resolved. In addition, the time on the client system must also be synchronized with the time on the domain controller.
de: Bei einem Domänenbeitritt gegen einen Domänencontroller auf Basis von Samba/AD muss die DNS-Konfiguration des Clients so eingerichtet sein, dass DNS-Einträge aus der DNS-Zone der UCS-Domäne aufgelöst werden können. Außerdem muss die Zeit auf dem Client-System mit der Zeit auf dem Domänencontroller synchronisiert sein.

source: Joining a domain requires one of the editions *Pro*, *Education*, or *Enterprise* of Windows 11. To join Windows 11 into a UCS domain, use the following steps:
de: Der Domänenbeitritt erfordert eine der Editionen *Pro*, *Education*, oder *Enterprise* von Windows 11. Um Windows 11 in eine UCS-Domäne zu joinen, führen sie die folgenden Schritte aus:

source: To open the Windows control panel, search for ``Control Panel`` in the field *Search*.
de: Um die Windows Systemsteuerung zu öffnen, suchen Sie nach ``Systemsteuerung`` im Feld *Suchen*.

source: On the *Control Panel* navigate to :menuselection:`System and Security --> System` scroll down and click :guilabel:`Domain or workgroup`. Select :menuselection:`Change settings --> Change`.
de: Navigieren Sie in der *Systemsteuerung* zu :menuselection:`System und Sicherheit --> System` und klicken Sie auf :guilabel:`Domäne oder Arbeitsgruppe`. Wählen Sie :menuselection:`Einstellungen ändern --> Ändern`.

source: Enable the option :guilabel:`Domain`.
de: Aktivieren Sie die Option :guilabel:`Domäne`.

source: Enter the name of the domain in the input field for the domain join. Use the full domain name, for example ``mydomain.intranet``. Click the :guilabel:`OK` button.
de: Geben Sie den Namen der Domäne in das Eingabefeld für den Domain Join ein. Verwenden Sie den vollständigen Domänennamen, zum Beispiel ``mydomain.intranet``. Klicken Sie auf die :guilabel:`OK` Schaltfläche.

source: Enter the *Username* and *Password* of a domain administrator account of the UCS domain in the respective input fields. In a UCS domain the default domain administrator username is ``Administrator``.
de: Geben Sie den *Benutzernamen* und das *Passwort* für das Konto eines Domänen Administrators der UCS-Domäne in die entsprechenden Eingabefelder ein. In einer UCS-Domäne ist der Standard-Benutzername des Domänen Administrators ``Administrator``.

source: Finally, to start the process for joining the domain, click :guilabel:`OK`.
de: Um den Domänenbeitritt zu starten, klicken Sie auf :guilabel:`OK`.

source: The joining of domains is only possible with the Pro and Enterprise editions of Windows 10.
de: Der Domänenbeitritt ist nur mit der Pro und Enterprise-Edition von Windows 10 möglich.

source: The control panel can be reached via the search field :guilabel:`Search the web and Windows`, which can be found in the start bar. Under :menuselection:`System and Security --> System` it must be clicked on :menuselection:`Change settings --> Change`.
de: Die Systemsteuerung kann über das Suchfeld :guilabel:`Web und Windows durchsuchen`, welches in der Startleiste zu finden ist, gesucht und geöffnet werden. Unter :menuselection:`System und Sicherheit --> System` muss auf :menuselection:`Einstellungen ändern --> Ändern` geklickt werden.

source: The :guilabel:`Domain` option field must be ticked and the name of the domain must be entered in the input field for the domain join. The full domain name should be used, e.g. ``mydomain.intranet``. After clicking on the :guilabel:`OK` button, the username of a domain administrator must be entered in the input field :guilabel:`Username`, by default this is ``Administrator``. The password of the domain administrator has to be entered in the input field :guilabel:`Password`. Finally, the process for joining the domain can then be started by clicking on :guilabel:`OK`.
de: Für den Domänenbeitritt muss das Optionsfeld :guilabel:`Domäne` markiert und der Name der Domäne in das Eingabefeld eingetragen werden. Es sollte dabei der vollständige Domänenname verwendet werden, z.B. ``mydomain.intranet``. Nach einem Klick auf die Schaltfläche :guilabel:`OK` muss in das Eingabefeld :guilabel:`Benutzername` der Benutzername eines Domänen Administrator, standardmäßig ist dies ``Administrator`` und in das Eingabefeld :guilabel:`Kennwort` das Passwort des Domänen Administrator eingetragen werden. Abschließend kann der Domänenbeitritt mit einem Klick auf :guilabel:`OK` gestartet werden.

source: The control panel can be reached by moving the cursor to the bottom right-hand corner of the screen. The *Control Panel* can then be searched for under :menuselection:`Search --> Apps`. :menuselection:`Change settings --> Network ID` must be clicked on under :menuselection:`System and Security --> System`.
de: Die Systemsteuerung kann erreicht werden, indem der Mauszeiger in die rechte untere Bildschirmecke bewegt wird. Anschließend kann unter :guilabel:`Suchen AR Apps` nach der *Systemsteuerung* gesucht werden. Unter :menuselection:`System und Sicherheit --> System` muss auf :guilabel:`Einstellungen ändern --> Netzwerk ID` geklickt werden.

source: The *Domain* option field must be ticked and the name of the Samba domain entered in the input field for the domain join. After clicking on the :guilabel:`OK` button, the username ``Administrator`` must be entered in the input field *Name* and the password from :samp:`uid=Administrator,cn=users,{LDAP base DN}` transferred to the *Password* input field. The process for joining the domain can then be started by clicking on :guilabel:`OK`.
de: Für den Domänenbeitritt muss das Optionsfeld *Domäne* markiert und der Name der Samba-Domäne in das Eingabefeld eingetragen werden. Nach einem Klick auf die Schaltfläche :guilabel:`OK` muss in das Eingabefeld *Name* der Name ``Administrator`` und in das Eingabefeld *Kennwort* das Passwort von :samp:`uid=Administrator,cn=users,{Basis-DN}` eingetragen werden. Abschließend kann der Domänenbeitritt mit einem Klick auf :guilabel:`OK` gestartet werden.

source: Ubuntu domain joins
de: Ubuntu-Domänenbeitritt

source: Univention provides the :program:`Univention Domain Join Assistant` to integrate Ubuntu clients into a UCS domain. Documentation and installation instructions are available at `Github <github-univention-domain-join_>`_.
de: Univention stellt den :program:`Univention Domain Join Assistant` für die Integration von Ubuntu-Clients in eine UCS-Domäne bereit. Die Dokumentation und Installationshinweise sind auf `Github <github-univention-domain-join_>`_ zu finden.

source: macOS domain joins
de: macOS-Domänenbeitritt

source: UCS supports domain joins of macOS clients into a UCS environment using Samba/AD. This documentation refers to macOS 10.8.2.
de: UCS unterstützt den Domänenbeitritt von macOS-Clients in eine UCS-Umgebung mit Samba 4. Diese Anleitung bezieht sich auf macOS 10.8.2.

source: The domain join can be performed using the system preferences menu or the :command:`dsconfigad` command line tool.
de: Der Domänenbeitritt kann über das Systemeinstellungsmenü oder den Kommandozeilenbefehl :command:`dsconfigad` erfolgen.

source: After the domain join it is possible to automatically mount CIFS shares to subfolders in :file:`/Volumes` when logging in with a domain user. For that, the following line has to be added to the file :file:`/etc/auto_master`:
de: Nach erfolgtem Domänenbeitritt besteht die Möglichkeit CIFS-Freigaben zu definieren, die bei der Anmeldung eines Benutzers unterhalb von :file:`/Volumes` automatisch eingehängt werden. Um dies zu erreichen, muss die folgende Zeile in die Datei :file:`/etc/auto_master` eingefügt werden:

source: In addition, the file :file:`/etc/auto_custom` needs to be created and the shares which should be mounted have to be listed in it in the following way:
de: Außerdem muss die Datei :file:`/etc/auto_custom` angelegt werden und die einzubindenden Freigaben dort in der folgenden Form aufgeführt werden:

source: Note that the automatically mounted shares are not displayed in the finder's sidebar.
de: Die eingebundenen Freigaben werden nicht in der Seitenleiste des Finders angezeigt.

source: Domain join using the system preferences GUI
de: Domänenbeitritt über das Systemeinstellungen-Menü

source: In the System Preferences via the :guilabel:`Users & Groups` entry, the :guilabel:`Login menu` can be reached. After authenticating by clicking on the lock in the lower left corner and providing credentials of a local *Administrator* account, the :guilabel:`Network Account Server: Join` button needs to be clicked. From that menu it is possible to open the *Directory Utility*.
de: In den Systemeinstellungen kann über :guilabel:`Benutzer` das Menü :guilabel:`Anmeldeoptionen` ausgewählt werden. Die Anmeldung erfolgt durch einen Klick auf das Schloss in der linken unteren Ecke, dort muss das lokale Administrator-Konto und dessen Passwort angegeben und :guilabel:`Netzwerk-Account-Server: Verbinden` angeklickt werden.

source: Domain join of a macOS system
de: Domänenbeitritt eines macOS-Systems

source: In the advanced options section, the option *Create mobile account at login* should be activated. A mobile account has the advantage that, when the domain is not available, the user can log into the macOS system with the same account used for logging into the domain.
de: In den erweiterten Einstellungen sollte die Option *Mobilen Account bei Anmeldung erstellen* aktiviert werden. Sie bietet den Vorteil, das auch ohne Verbindung zur Domäne eine Anmeldung mit der Domänenbenutzerkennung erfolgen kann.

source: After filling in the domain name in the field *Active Directory Domain* and the hostname of the macOS client in the field *Computer ID*, the join process is initiated after clicking the button :guilabel:`Bind...`. The username and password of an account in the ``Domain Admins`` group needs to be entered, e.g., ``Administrator``.
de: Der Domänenname muss nun im Feld *Active Directory Domain* und der Rechnername des macOS-Clients in das Feld *Computer-ID* eingetragen werden. Der Domänenbeitritt erfolgt nach einem Klick auf :guilabel:`OK`. Für den Domänenbeitritt muss ein Konto aus der Gruppe ``Domain Admins`` verwendet werden, z.B. ``Administrator``.

source: Domain join on the command line
de: Domänenbeitritt auf den Kommandozeile

source: The domain join can also be performed on the command line using :command:`dsconfigad`:
de: Der Domänenbeitritt kann auch auf der Kommandozeile mit dem Befehl :command:`dsconfigad` erfolgen:

source: Additional configuration options are available through :command:`dsconfigad -help`.
de: Weitere Optionen werden mit :command:`dsconfigad -help` angezeigt.

source: Fault-tolerant domain setup
de: Fehlertolerante Domain Einrichtung

source: In a domain exist some services that are important for the functionality of all of its members. Redundancy can be used to remove those single points of failure. An article in the Univention Support database explains how to secure LDAP, Kerberos, DNS, DHCP and Active Directory-compatible Domain Controllers: :uv:kb:`Fail-safe domain setup <6682>`.
de: Einige Dienste in einer Domäne sind zentral für das Funktionieren von deren Mitgliedern. Redundanz ist ein Mittel um diesen potenziellen Bruchstellen (*single points of failure*) zu entfernen. Ein Artikel in der Univention Support Datenbank erklärt das Vorgehen um die Dienste LDAP, Kerberos, DNS, DHCP und Active Directory-kompatible Domain Controller abzusichern: :uv:kb:`Fail-safe domain setup <6682>`.

source: Chapter contents:
de: Kapitelinhalte:

source: Domain services / LDAP directory
de: Domänendienste / LDAP-Verzeichnisdienst

source: Univention Corporate Server offers a cross platform domain concept with a common trust context between Linux and/or Windows systems. Within this domain a user is known to all systems via their username and password stored in the |UCSUMS| and can use all services which are authorized for them. The management system keeps the account synchronized for the windows login, Linux/POSIX systems and Kerberos. The management of user accounts is described in :ref:`users-general`.
de: Univention Corporate Server bietet ein plattformübergreifendes Domänenkonzept mit einem gemeinsamen Vertrauenskontext zwischen Linux- und Windows-Systemen. Innerhalb dieser Domäne ist ein Benutzer mit seinem im |UCSUMS| hinterlegten Benutzernamen und Passwort auf allen Systemen bekannt, und kann für ihn freigeschaltete Dienste nutzen. Das Konto wird über das Managementsystem sowohl für die Windows-Anmeldung als auch für Linux/POSIX-Systeme und Kerberos synchron gehalten. Die Verwaltung von Benutzerkonten ist in :ref:`users-general` beschrieben.

source: All UCS and Windows systems within a UCS domain have a host domain account. This allows system-to-system authentication. Domain joining is described in :ref:`domain-join`.
de: Alle UCS- und Windowssysteme innerhalb einer UCS-Domäne verfügen über ein Domänenkonto, sobald sie der UCS-Domäne beigetreten sind. Der Domänenbeitritt wird in :ref:`domain-join` beschrieben.

source: The certificate authority (CA) of the UCS domain is operated on the |UCSPRIMARYDN|. A SSL certificate is generated there for every system that has joined the domain. Further information can be found in :ref:`domain-ssl`.
de: Auf dem |UCSPRIMARYDN| wird die Certificate Authority (CA) der UCS-Domäne betrieben. Dort wird für jedes der Domäne beigetretene System ein SSL-Zertifikat generiert. Weitere Informationen finden sich in :ref:`domain-ssl`.

source: Every computer system which is a member of a UCS domain has a system role. This system role represents different permissions and restrictions, which are described in :ref:`system-roles`.
de: Jedes Rechnersystem, das Mitglied einer UCS-Domäne ist, besitzt eine Systemrolle. Aus dieser Systemrolle ergeben sich verschiedene Berechtigungen und Einschränkungen, die in :ref:`system-roles` beschrieben sind.

source: All domain-wide settings are stored in a directory service on the basis of OpenLDAP. :ref:`domain-ldap` describes how to expand the managed attributes with LDAP scheme expansions, how to set up an audit-compliant LDAP documentation system and how to define access permissions to the LDAP directory.
de: Alle domänenweiten Einstellungen werden in einem Verzeichnisdienst auf Basis von OpenLDAP vorgehalten. In :ref:`domain-ldap` wird beschrieben wie der Speicherumfang durch LDAP-Schema-Erweiterungen ergänzt werden kann, wie eine revisionssichere LDAP-Protokollierung eingerichtet werden kann und wie Zugriffsberechtigungen auf das LDAP-Verzeichnis definiert werden können.

source: Replication of the directory data within a UCS domain occurs via the Univention Directory Listener / Notifier mechanism. Further information can be found in :ref:`domain-listener-notifier`.
de: Die Replikation der Verzeichnisdaten innerhalb einer UCS-Domäne erfolgt über den Listener/Notifier-Mechanismus. Weitere Informationen finden sich in :ref:`domain-listener-notifier`.

source: Kerberos is an authentication framework the purpose of which is to permit secure identification in the potentially insecure connections of decentralized networks. Every UCS domain operates its own Kerberos trust context (realm). Further information can be found in :ref:`domain-kerberos`.
de: Kerberos ist ein Authentifikationsverfahren um in verteilten Netzen über potentiell unsichere Verbindungen eine sichere Identifikation zu erlauben. Jede UCS-Domäne betreibt einen eigenen Kerberosvertrauenskontext (Realm). Weitere Informationen finden sich in :ref:`domain-kerberos`.

source: Kerberos is an authentication framework the purpose of which is to permit secure identification in the potentially insecure connections of decentralized networks. In Kerberos, all clients use a foundation of mutual trust, the *Key Distribution Center* (KDC). A client authenticates at this KDC and receives an authentication token, the so-called ticket which can be used for authentication within the Kerberos environment (the so-called Kerberos realm). The name of the Kerberos realm is configured as part of the installation of the |UCSPRIMARYDN| and stored in the |UCSUCRV| :envvar:`kerberos/realm`. It is not possible to change the name of the Kerberos realm at a later point in time.
de: Kerberos ist ein Authentifikationsverfahren um in verteilten Netzen über potentiell unsichere Verbindungen eine sichere Identifikation zu erlauben. Alle Clients verwenden dabei eine gemeinsame Vertrauensbasis, das *Key Distribution Centre* (KDC). Ein Client authentifiziert sich bei diesem KDC und erhält ein Authentifizierungstoken, das sogenannte Ticket, das zur Authentizierung innerhalb einer Kerberos-Umgebung (der sogenannten Kerberos Realm) verwendet werden kann. Der Name der Kerberos Realm wird im Rahmen der Installation des |UCSPRIMARYDN| konfiguriert und in der |UCSUCRV| :envvar:`kerberos/realm` gespeichert. Der Name der Kerberos-Realm kann nachträglich nicht angepasst werden.
