Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/groups.po
Languages: de

source: You can use the |UCSUCRV| :envvar:`ldap/overlay/memberof` to activate or deactivate the module. UCS activates the overlay module by default since UCS 4.3. UCS requires the overlay module for proper operation. The recommendation to administrators of older installations is to activate the module manually.
de: Sie können die |UCSUCRV| :envvar:`ldap/overlay/memberof` verwenden, um das Modul zu aktivieren oder zu deaktivieren. UCS aktiviert das Overlay-Modul standardmäßig seit UCS 4.3. UCS benötigt das Overlay-Modul für den ordnungsmäßigen Betrieb. Die Empfehlung für Administratoren von älteren Installationen ist, dieses Modul nachträglich zu aktivieren.

source: Before using this feature, please read :uv:kb:`memberOf attribute: Group memberships of user and computer objects <6439>` about activating the OpenLDAP ``memberOf`` overlay module.
de: Bevor Sie diese Funktion verwenden, lesen Sie bitte :uv:kb:`memberOf attribute: Group memberships of user and computer objects <6439>` (Englisch) über die Aktivierung des ``memberOf`` Overlay-Moduls.

source: By default, user accounts use the user attribute ``memberOf``. You can use the |UCSUCRV| :envvar:`ldap/overlay/memberof/memberof` to configure a different attribute.
de: Standardmäßig verwenden Benutzerkonten das das Benutzerattribut ``memberOf``. Sie können die |UCSUCRV| :envvar:`ldap/overlay/memberof/memberof` verwenden, um ein anderes Attribut zu konfigurieren.

source: By default, UCS uses groups matching ``objectClass=posixGroup`` and their attribute ``uniqueMember``. You can use the |UCSUCRV|\ s :envvar:`ldap/overlay/memberof/objectclass` and :envvar:`ldap/overlay/memberof/member` to configure a different object class and attribute.
de: Standardmäßig verwendet UCS auf ``objectClass=posixGroup`` passende Benutzergruppen und deren Attribute ``uniqueMember``. Sie können die |UCSUCRV|\ n :envvar:`ldap/overlay/memberof/objectclass` und :envvar:`ldap/overlay/memberof/member` verwenden, um eine andere Objektklasse und ein anderes Attribute zu konfigurieren.

source: Troubleshooting
de: Fehlersuche

source: Sometimes the membership information becomes inconsistent between groups and users. In this case, as administrator run the program :command:`/usr/share/univention-ldap-overlay-memberof/univention-update-memberof` on any affected directory server node.
de: In bestimmten Situationen können die Beziehungen zwischen Gruppen und Benutzers inkonsistent werden. Führen Sie als Administrator in diesem Fall das Programm :command:`/usr/share/univention-ldap-overlay-memberof/univention-update-memberof` auf jedem betroffenen Directory Node ausführen.
