Repository: sanyaade-teachings/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/groups.po
Languages: de

source: Group management
de: Gruppenverwaltung

source: Permissions in UCS are predominantly differentiated between on the basis of *groups*. Groups are stored in the LDAP and are thus identical on all systems. Groups can contain not only user accounts, but can also optionally accept computer accounts.
de: Berechtigungen werden in UCS überwiegend auf Basis von *Gruppen* unterschieden. Gruppen werden im LDAP gespeichert und sind somit auf allen Systemen identisch. Gruppen können nicht nur Benutzerkonten enthalten, sondern optional auch Rechnerkonten aufnehmen.

source: In addition, there are also local user groups on each system, which are predominantly used for hardware access. These are not managed through the |UCSUMS|, but saved in the :file:`/etc/group` file.
de: Auf jedem System gibt es darüber hinaus auch noch lokale Benutzergruppen, die vor allem für den Zugriff auf Hardware verwendet werden. Diese werden nicht durch das |UCSUMS| verwaltet, sondern in der Datei :file:`/etc/group` gespeichert.

source: User group assignments
de: Zuordnung von Benutzergruppen

source: The assignment of users to groups is performed in two ways:
de: Die Zuordnung von Benutzern zu Gruppen erfolgt auf zwei Wegen:

source: A selection of groups can be assigned to a user in the user management, see :ref:`users-management`.
de: In der Benutzerverwaltung kann einem Benutzer eine Auswahl von Gruppen zugewiesen werden, siehe :ref:`users-management`.

source: A selection of users can be assigned to a group in the group management, see :ref:`groups-management`.
de: In der Gruppenverwaltung kann einer Gruppe eine Auswahl von Benutzern zugeordnet werden, siehe :ref:`groups-management`.

source: Recommendation for group name definition
de: Empfehlung für Definition von Gruppennamen

source: One very important and required attribute for groups is the group name. To avoid conflicts with the different tools handling groups in UCS, adhere to the following recommendations for the definition of group names:
de: Ein sehr wichtiges und erforderliches Attribut für Gruppen ist der Gruppenname. Um Konflikte mit den verschiedenen Werkzeugen zu vermeiden, die Gruppen in UCS verarbeiten, berücksichtigen Sie die folgenden Empfehlungen für die Definition von Gruppennamen:

source: Only use upper and lower case letters (``A-Za-z``), digits (``0-9``) the hyphen (``-``) and space from the ASCII character set for group names.
de: Verwenden Sie für Gruppennamen nur Groß- und Kleinbuchstaben (``A-Za-z``), Ziffern (``0-9``), den Bindestrich (``-``) und Leerzeichen aus dem ASCII-Zeichensatz.

source: The group name starts with a letter from the ASCII character set. The space is not allowed as first or last character. The hyphen is not allowed as last character.
de: Der Gruppenname beginnt mit einem Buchstaben aus dem ASCII-Zeichensatz. Das Leerzeichen ist weder als erstes, noch als letztes Zeichen erlaubt. Der Bindestrich als letztes Zeichen ist nicht erlaubt.

source: In UCS the group name has at least a length of 4 characters and at most 20 characters.
de: In UCS hat der Gruppenname eine Länge von mindestens 4 und höchstens 20 Zeichen.

source: The recommendation results in the following regular expression::
de: Die Empfehlung ergibt den folgenden regulären Ausdruck::

source: Consider the recommendation as a guideline and not a rule and keep potential side-effects in mind when defining group names outside the recommendation.
de: Betrachten Sie die Empfehlung als Richtlinie und nicht als harte Regel und bedenken Sie mögliche Nebenwirkungen, wenn Sie Gruppennamen außerhalb der Empfehlung definieren.

source: Managing groups via |UCSUMC| module
de: Verwaltung von Gruppen über |UCSUMC| Modul

source: Groups are managed in the UMC module :guilabel:`Groups` (see :ref:`central-user-interface`).
de: Gruppen werden im UMC-Modul *Gruppen* verwaltet (siehe auch :ref:`central-user-interface`).

source: Creating a group via UMC module
de: Anlegen einer Gruppe im UMC-Modul

source: Group management module - General tab
de: Gruppenmanagement Modul - Reiter Allgemein

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: Defines the name of the group. For recommended characters for the group name, see :ref:`groups-recommendation-group-name`.
de: Definiert den Namen der Gruppe. Für empfohlene Zeichen für den Gruppennamen, siehe :ref:`groups-recommendation-group-name`.

source: By default it is not possible to create a group with the same name as an existing user. If the |UCSUCRV| :envvar:`directory/manager/user_group/uniqueness` is set to ``false``, this check is removed.
de: In der Grundeinstellung kann keine Gruppe mit dem Namen eines existierenden Benutzers angelegt werden. Wird die |UCSUCRV| :envvar:`directory/manager/user_group/uniqueness` auf ``false`` gesetzt, wird diese Prüfung aufgehoben.

source: A description of the group can be entered here.
de: Hier kann eine beliebige Beschreibung für die Gruppe eingetragen werden.

source: Users
de: Benutzer

source: This input field can be used for adding users as members to the group.
de: In diesem Eingabefeld können Benutzer als Mitglieder in diese Gruppe aufgenommen werden.

source: Groups
de: Gruppen

source: On this input field, other groups can be added as members of the current group (groups in groups).
de: In diesem Eingabefeld können Gruppen als Mitglieder in diese Gruppe aufgenommen werden (Gruppen in Gruppen).

source: Group management module - Advanced settings tab
de: Gruppenmanagement Modul - Reiter Erweiterte Einstellungen

source: *Advanced settings* tab
de: Reiter *Erweiterte Einstellungen*

source: These options define a mail group and are documented in the :ref:`mail-management-mailgroups`.
de: Diese Optionen definieren eine Mailgruppe und sind in :ref:`mail-management-mailgroups` dokumentiert.

source: Host members
de: Enthaltene Rechner

source: This field can be used for accepting computers as members of the group.
de: In diesem Feld können Rechner als Mitglieder in diese Gruppe aufgenommen werden.

source: Nested groups
de: Mitglied von

source: The current group can be added as a member to other groups here (groups in groups).
de: Hier kann diese Gruppe einer oder mehreren anderen Gruppen als Mitglied hinzugefügt werden (Gruppen in Gruppen).

source: Group ID
de: Gruppen ID

source: If a group is to be assigned a certain group ID, the ID in question can be entered in this field. Otherwise the next available group ID will be automatically assigned when adding the group. The group ID cannot be subsequently changed. When editing the group, the group ID will be represented in gray.
de: Wenn der Gruppe eine bestimmte Gruppen-ID zugewiesen werden soll, kann die Gruppen-ID in diesem Eingabefeld eingetragen werden. Ansonsten wird der Gruppe automatisch die nächste freie Gruppen-ID zugeordnet. Sie kann nachträglich nicht geändert werden und wird beim Bearbeiten der Gruppe ausgegraut angezeigt.

source: The group ID may consist of integers between 1000 and 59999 and between 65536 and 100000.
de: Als Gruppen-ID können ganze Zahlen zwischen 1000 und 59999 sowie zwischen 65536 und 1000000 frei vergeben werden.

source: The relative ID (RID) is the local part of the Security ID (SID) and is used in Windows and Samba domains. If a group is to be assigned a certain RID, the ID in question can be entered in this field. Otherwise a RID will be automatically assigned.
de: Die Relative ID (RID) ist der lokale Teil der Security ID (SID) und wird in Windows- und Samba-Domänen verwendet. Wenn der Gruppe eine bestimmte RID zugewiesen werden soll, kann sie in diesem Eingabefeld eingetragen werden. Ansonsten wird automatisch eine RID zugewiesen.

source: The RID cannot be subsequently changed. When editing the group, the group ID will be represented in gray.
de: Die RID kann nachträglich nicht geändert werden und wird beim Bearbeiten der Gruppe ausgegraut angezeigt.

source: The RIDs below 1000 are reserved for standard groups and other special objects.
de: Die RIDs bis 1000 sind Standard-Gruppen und anderen speziellen Objekten vorbehalten.

source: When Samba/AD is used, the RID is generated by Samba and cannot be specified.
de: Bei Verwendung von Samba/AD wird die RID durch Samba generiert und kann nicht vorgegeben werden.

source: :menuselection:`Windows --> group type`
de: :menuselection:`Windows --> Gruppentyp`

source: This group type is evaluated when the user logs in to a Samba/AD-based domain. Three types of Windows groups can be distinguished:
de: Dieser Gruppentyp wird ausgewertet, wenn der Benutzer sich an einer Domäne auf Basis von Samba/AD anmeldet. Man unterscheidet zwischen drei Windows-Gruppentypen:

source: Domain Groups
de: Domänengruppen

source: are known across the domain. This is the default group type.
de: sind domänenweit bekannt. Neu erstellte Gruppen im UMC-Modul *Gruppen* sind standardmäßig von diesem Typ.

source: Local groups
de: Lokale Gruppen

source: are only relevant on Windows servers. If a local group is created on a Windows server, this group is known solely to the server; it is not available across the domain. UCS, in contrast, does not differentiate between local and global groups. After taking over an AD domain, local groups in UCS can be handled in the same way as global groups.
de: sind nur auf Windows-Servern von Bedeutung. Wird auf einem Windows-Server eine lokale Gruppe erstellt, ist sie nur dem Server bekannt und ist nicht domänenweit verfügbar. UCS hingegen unterscheidet nicht zwischen lokalen und globalen Gruppen. Von einer AD-Domäne übernommene lokale Gruppen werden in UCS wie globale Gruppen verwaltet.

source: Well-known group
de: Bekannte Gruppe

source: This group type covers groups preconfigured by Samba/Windows servers which generally have special privileges, e.g., ``Power Users``.
de: Unter diesem Gruppentyp werden von Samba- und Windows-Servern vorkonfigurierte Gruppen zusammengefasst, die in der Regel über besondere Berechtigungen verfügen, z.B. ``Power Users``.

source: :menuselection:`Windows --> AD group type`
de: :menuselection:`Windows --> AD Gruppentyp`

source: This group type is only evaluated when the user logs in to a Samba/AD-based domain (which offers Active Directory domain services). These groups are described in :ref:`groups-adgroups`.
de: Dieser Gruppentyp wird nur ausgewertet, wenn der Benutzer sich an einer Domäne auf Basis von Samba/AD anmeldet (das Active Directory-Domänendienste bereitstellt). Diese Gruppen sind in :ref:`groups-adgroups` beschrieben.

source: :menuselection:`Windows --> Samba privileges`
de: :menuselection:`Windows --> Samba-Privilegien`

source: This input mask can be used to assign Windows system rights to a group, e.g., the right to join a Windows client in the domain. This function is documented in :ref:`users-management`.
de: Mit dieser Eingabemaske wird einer Gruppe Windows-Systemrechte zugewiesen, z.B. die Berechtigung einen Windows-Client in die Domäne zu joinen. Diese Funktionalität ist in :ref:`users-management` dokumentiert.

source: Group management module - Options settings tab
de: Gruppenmanagement Modul - Reiter Optionseinstellungen

source: This tab is only available when adding groups, not when editing groups. Certain LDAP object classes for the group can be de-selected here. The entry fields for the attributes of these classes can then no longer be filled in.
de: Diese Karteikarte steht nur beim Hinzufügen von Gruppen zur Verfügung, nicht aber beim Bearbeiten von Gruppen. Sie ermöglicht es, bestimmte LDAP-Objektklassen für die Gruppe abzuwählen. Die Eingabefelder für Attribute dieser Klassen können dann nicht ausgefüllt werden.

source: *Options* tab
de: Reiter *Optionen*

source: Samba group
de: Samba-Gruppe

source: This checkbox indicates whether the group contains the object class ``sambaGroupMapping``.
de: Dieses Auswahlkästchen gibt an, ob die Gruppe die Objektklasse ``sambaGroupMapping`` erhält.

source: POSIX group
de: POSIX-Gruppe

source: This checkbox indicates whether the group contains the object class ``posixGroup``.
de: Dieses Auswahlkästchen gibt an, ob die Gruppe die Objektklasse ``posixGroup`` erhält.

source: Group nesting with groups in groups
de: Verschachtelte Gruppen mit Gruppen in Gruppen

source: UCS supports group nesting (also known as "groups in groups"). This simplifies the management of the groups. For example, if two locations are managed in one domain, two groups can be formed ``IT staff location A`` and ``IT staff location B``, to which the user accounts of the location's IT staff can be assigned respectively.
de: UCS unterstützt die Verschachtelung von Gruppen (auch bekannt als "Gruppen in Gruppen"). Dies vereinfacht die Verwaltung der Gruppen: Werden in einer Domäne beispielsweise zwei Standorte verwaltet, können zwei Gruppen ``Techniker Standort A`` und ``Techniker Standort B`` gebildet werden, denen jeweils die Benutzerkonten der Standort-Techniker zugewiesen werden.

source: To create a cross-location group, it is then sufficient to define the groups ``IT staff location A`` and ``IT staff location B`` as members.
de: Um eine standortübergreifende Techniker-Gruppe zu bilden, reicht es dann aus, die Gruppen ``Techniker Standort A`` und ``Techniker Standort B`` als Mitglieder dieser Gruppe zu definieren.

source: Cyclic dependencies of nested groups are automatically detected and refused. This check can be disabled with the |UCSUCRV| :envvar:`directory/manager/web/modules/groups/group/checks/circular_dependency`. Cyclic memberships must also be avoided in direct group changes without the |UCSUMS|.
de: Zyklische Abhängigkeiten von Gruppen in Gruppen werden erkannt und abgewiesen. Diese Prüfung kann durch die |UCSUCRV| :envvar:`directory/manager/web/modules/groups/group/checks/circular_dependency` deaktiviert werden. Auch bei direkten Gruppenänderungen ohne das |UCSUMS| müssen zyklische Mitgliedschaften vermieden werden.

source: The resolution of nested group memberships is performed during the generation of the group cache (see :ref:`groups-cache`) and is thus transparent for applications.
de: Die Auflösung der verschachtelten Gruppenmitgliedschaften erfolgt während der Expandierung des Gruppencaches (siehe :ref:`groups-cache`) und ist somit für Applikationen transparent.

source: Local group cache
de: Lokaler Gruppencache

source: The user and computer information retrieved from the LDAP is cached by the Name Server Cache Daemon (NSCD), see :ref:`computers-nscd`.
de: Aus dem LDAP aufgelöste Benutzer- und Rechnerinformationen werden durch den Name Server Cache Daemon (NSCD) zwischengespeichert, siehe :ref:`computers-nscd`.

source: Since UCS 3.1, the groups are no longer cached via the NSCD for performance and stability reasons; instead they are now cached by the NSS module :program:`libnss-extrausers`. The group information is automatically exported to the :file:`/var/lib/extrausers/group` file by the :file:`/usr/lib/univention-pam/ldap-group-to-file.py` script and read from there by the NSS module.
de: Die Zwischenspeicherung der Gruppen erfolgt seit UCS 3.1 aus Performance- und Stabilitätsgründen nicht mehr über den NSCD, sondern durch das NSS-Modul :program:`libnss-extrausers`. Die Gruppeninformationen werden automatisch durch das Skript :file:`/usr/lib/univention-pam/ldap-group-to-file.py` in die Datei :file:`/var/lib/extrausers/group` exportiert und dort von dem NSS-Modul ausgelesen.

source: In the basic setting, the export is performed once a day by a cron job and is additionally started if the |UCSUDL| has been inactive for 15 seconds. The interval for the cron update is configured in Cron syntax (see :ref:`cron-local`) by the |UCSUCRV| :envvar:`nss/group/cachefile/invalidate_interval`. This listener module can be activated/deactivated via the |UCSUCRV| :envvar:`nss/group/cachefile/invalidate_on_changes` (``true``/``false``).
de: Der Export erfolgt in der Grundeinstellung einmal täglich durch einen Cron-Job und wird zusätzlich gestartet wenn der |UCSUDL| 15 Sekunden inaktiv gewesen ist. Das Intervall für die Cron-Aktualisierung wird über die |UCSUCRV| :envvar:`nss/group/cachefile/invalidate_interval` in Cron-Syntax (siehe :ref:`cron-local`) festgelegt. Das Listener-Modul kann über die |UCSUCRV| :envvar:`nss/group/cachefile/invalidate_on_changes` aktiviert/deaktiviert werden (``true``/``false``).

source: When the group cache file is being generated, the script can verify whether the group members are still present in the LDAP directory. If not only UMC modules are used for user management, this additional check can be can be enabled by setting the |UCSUCRV| :envvar:`nss/group/cachefile/check_member` to ``true``.
de: Während des Generierens der Gruppencache-Datei kann das Skript prüfen, ob die Gruppenmitglieder weiterhin im LDAP-Verzeichnis vorhanden sind. Werden für die Verwaltung der Verzeichnisdaten nicht ausschließlich UMC-Module eingesetzt, kann die zusätzliche Prüfung durch Setzen der |UCSUCRV| :envvar:`nss/group/cachefile/check_member` auf ``true`` aktiviert werden.

source: Synchronization of Active Directory groups when using Samba/AD
de: Synchronisation von Active Directory-Gruppen bei Verwendung von Samba/AD

source: If Samba/AD is used, the group memberships are synchronized between the Samba/AD directory service and the OpenLDAP directory service by the Univention S4 connector, i.e., each group on the UCS side is associated with a group in Active Directory. General information on the Univention S4 connector can be found in :ref:`windows-s4-connector`.
de: Wird Samba/AD eingesetzt, werden die Gruppenmitgliedschaften zwischen dem Samba 4-Verzeichnisdienst und dem OpenLDAP-Verzeichnisdienst durch den Univention S4-Connector synchronisiert, d.h. jede Gruppe auf UCS-Seite ist einer Gruppe im Active Directory assoziiert. Allgemeine Hinweise zum Univention S4 Connector finden sich in :ref:`windows-s4-connector`.

source: Some exceptions are formed by the *pseudo groups*, sometimes also called system groups. These are only managed internally by Active Directory/Samba, e.g., the ``Authenticated Users`` group includes a list of all the users currently logged on to the system. Pseudo groups are stored in the UCS directory service, but they are not synchronized by the Univention S4 connector and should usually not be edited. This applies to the following groups:
de: Einzige Ausnahme sind die *Pseudogruppen*, manchmal auch als Systemgruppen bezeichnet. Diese werden nur intern von Active Directory/Samba verwaltet, z.B. enthält die Gruppe ``Authenticated Users`` eine Liste aller aktuell an einem System angemeldeten Benutzer. Pseudogruppen sind im UCS-Verzeichnisdienst vorhanden; sie werden aber nicht durch den Univention S4 Connector synchronisiert und müssen normalerweise nicht bearbeitet werden. Dies betrifft die folgenden Gruppen:

source: In Active Directory/Samba, a distinction is made between the following four AD group types. These group types can be applied to two types of groups; *security groups* configure permissions (corresponding to the UCS groups), whilst *distribution groups* are used for mailing lists:
de: Man unterscheidet in Active Directory/Samba zwischen den folgenden vier AD-Gruppentypen. Diese Gruppentypen können auf zwei Arten von Gruppen angewendet werden; *Sicherheitsgruppen* konfigurieren Berechtigungen (entsprechend den UCS-Gruppen), während *Verteilungsgruppen* für Mailverteiler genutzt werden:

source: Local
de: Lokal

source: *Local* groups only exist locally on a host. A local group created in Samba/AD is synchronized by the Univention S4 Connector and thus also appears in the UMC module :guilabel:`Groups`. There is no need to create local groups in the UMC module.
de: *Lokale Gruppen* existieren immer nur lokal auf einem Rechner. Eine lokale Gruppe, die in Samba/AD angelegt wurde, wird durch den Univention S4 Connector synchronisiert und erscheint daher auch im UMC-Modul :guilabel:`Gruppen`. Es besteht aber keine Notwendigkeit lokale Gruppen im UMC-Modul anzulegen.

source: *Global* groups are the standard type for newly created groups in the UMC module :guilabel:`Groups`. A global group applies for one domain, but it can also accept members from other domains. If there is a trust relationship with a domain, the groups there are displayed and permissions can be assigned. However, the current version of UCS does not support multiple domains/forests or outgoing trust relationships.
de: *Globale Gruppen* sind der Standardtyp für neu angelegte Gruppen im UMC-Modul :guilabel:`Gruppen`. Eine globale Gruppe gilt für eine Domäne, es können aber keine Konten anderer Domänen aufgenommen werden. Besteht eine Vertrauensstellung zu einer Domäne, werden die Gruppen dort angezeigt und es können Berechtigungen zugewiesen werden. Die aktuelle Version von UCS unterstützt allerdings weder mehrfache Domänen/Forests, noch von UCS ausgehende Vertrauensstellungen.

source: Domain local
de: Domänenlokal

source: *Domain local* groups can also adopt members of other domains (insofar as there is a trust relationship in place or they form part of a forest). Local domain groups are only shown in their own domain though. However, the current version of UCS does not support multiple domains/forests or outgoing trust relationships.
de: *Domänenlokale Gruppen* können auch Mitglieder anderer Domänen aufnehmen (sofern zu diesen eine Vertrauenstellung besteht oder sie Teil eines Forests ist). Domänenlokale Gruppen werden aber nur in der eigenen Domäne angezeigt. Die aktuelle Version von UCS unterstützt allerdings weder mehrfache Domänen/Forests, noch von UCS ausgehende Vertrauensstellungen.

source: Universal
de: Universell

source: *Universal* groups can adopt members from all domains and these members are also shown in all the domains of a forest. These groups are stored in a separate segment of the directory service, the so-called *global catalog*. Domain forests are currently not supported by Samba/AD.
de: *Universelle Gruppen* können Mitglieder aus allen Domänen aufnehmen und diese Mitglieder werden auch in allen Domänen eines Forests angezeigt. Diese Gruppen werden in einem separaten Segment des Verzeichnisdienstes gespeichert, dem sogenannten *Global Catalog*. Domänen-Forests werden aktuell von Samba/AD nicht unterstützt.

source: Overlay module for displaying the group information on user objects
de: Overlay-Modul zur Anzeige der Gruppeninformationen an Benutzerobjekten

source: The UCS directory service only saves group membership properties in the group objects and not in the respective user objects. However, some applications expect group membership properties at the user objects, for example in the attribute ``memberOf``. An overlay module in the LDAP server makes it possible to manage these attributes automatically based on the group information.
de: Der UCS-Verzeichnisdienst speichert Gruppenmitgliedschaften nur an den Gruppenobjekten und nicht am jeweiligen Benutzerobjekt. Einige Applikationen erwarten jedoch die Gruppenmitgliedschaften an den Benutzerobjekten, zum Beispiel im Attribut ``memberOf``. Durch ein Overlay-Modul im LDAP-Server können diese Attribute automatisch anhand der Gruppeninformationen verwaltet werden.
