Repository: sanyaade-teachings/univention-corporate-server
Catalog: management/univention-management-console-module-diagnostic/umc/python/diagnostic/*.po
Languages: de

source: The package status of %s packages is corrupt.
de: Der Paketstatus von %s Paketen ist korrupt.

source: The preferred way now is to register them in LDAP; this is less error prone in situations like backup2master.
de: Der bevorzugte Weg ist mittlerweise, sie im LDAP zu registrieren; das ist in Situationen wie backup2master weniger fehleranfällig.

source: The primary LDAP Server of this System (UCR ldap/master) is not set to the Primary Directory Node of this UCS domain (%s).
de: Der primäre LDAP-Server dieses Systems (UCR ldap/master) ist nicht auf den Primary Directory Node der UCS Umgebung konfiguriert (%s).

source: The primary LDAP Server of this System (UCR ldap/server/name) is set to the Primary Directory Node of this UCS domain (%s). Since this environment provides further LDAP Servers, we recommend a different configuration to reduce the load on the Primary Directory Node. Please see {sdb} for further information.
de: Der primäre LDAP-Server dieses Systems (UCR ldap/server/name) ist in der Standardkonfiguration auf den Primary Directory Node der UCS Umgebung konfiguriert (%s). In dieser Umgebung sind weitere LDAP-Server verfügbar, daher empfehlen wir zur Entlastung des Primary Directory Node eine andere Konfiguration. Siehe {sdb} für weiter Hinweise zur Konfiguration.

source: The proxy host could not be reached. Make sure that hostname (%(hostname)r) and port (%(port)r) are correctly set up.
de: Der Proxy-Host konnte nicht erreicht werden. Bitte sicherstellen, dass Rechnername (%(hostname)r) und Port (%(port)r) korrekt eingestellt sind.

source: The proxy server is reachable but the HTTP response status code (%d) does not indicate success.
de: Der Proxy-Server ist erreichbar aber der HTTP-Antwort-Status-Code (%d) besagt keinen Erfolg.

source: The registration failed: %s
de: Die Registrierung schlug fehl: %s

source: The security limits (e.g. for max_open_files) are currently not configured properly.
de: Die Sicherheitslimits (z.B. für max_open_files) sind derzeit nicht geeignet eingestellt.

source: The server did not respond within %d seconds. Please check your network configuration.
de: Der Server antwortete nicht innerhalb von %d Sekunden. Bitte Netzwerkeinstellungen überprüfen.

source: The ssh connection to at least one other UCS server failed.
de: Die SSH-Verbindung zu mindestens einem anderen UCS Server ist fehlgeschlagen.

source: The ssh host key of the remote server has changed (maybe the host was reinstalled).
de: Der SSH Host-Key des entfernten Rechners hat sich geändert (vielleicht wurde der Rechner neu installiert).

source: The variable %(name)r is deprecated and should no longer be used.
de: Die Variable %(name)r ist veraltet und sollte nicht mehr benutzt werden.

source: The variable %(variable)r has the invalid value %(value)r.
de: Die Variable %(variable)r hat den ungültigen Wert %(value)r.

source: There is no gateway configured.
de: Es ist kein Gateway eingerichtet.

source: There was an error using the proxy server. The {setup:network} can be used to change the proxy configuration.
de: Es gab einen Fehler beim Benutzen des Proxy-Servers. Das {setup:network} kann zur Veränderung der Proxy-Konfiguration genutzt werden.

source: These objects were found:
de: Diese Objekte wurden gefunden:

source: This can be fixed only manually using the Repository Settings module or the UCR module.
de: Dies kann nur manuell im Modul Repository Einstellungen oder im UCR Modul korrigiert werden.

source: This can cause several different serious problems (e.g. the login at samba servers may be impossible, file operations (copy, move) on shares can fail, etc.)
de: Dies kann mehrere verschiedene ernsthafte Probleme verursachen (z.B. Login an Samba-Servern unmöglich, Dateioperationen (Kopieren, Verschieben) auf Freigaben kann fehlschlagen, uvm.)

source: This check has been added recently; some warning may be unproblematic.
de: Dieser Test wurde erst kürzlich hinzugefügt; einige Warnungen können unproblematisch sein.

source: This is a Samba 4 DC, but `samba-tool processes` reports no `kdc_server`.
de: Dies ist ein Samba 4 DC, aber `samba-tool processes` zeigt keinen `kdc_server` an.

source: This is not necessarily a problem, if the the ACL got changed via IMAP.
de: Dies ist nicht notwendigerweise ein Problem, wenn die ACL Einträge per IMAP geändert wurden.

source: This may be, because Heimdal KDC seems to be running.
de: Dies mag daher kommen, dass Heimdal KDC läuft.

source: This may be, because `kerberos/autostart` is not disabled.
de: Dies mag daher kommen, dass `kerberos/autostart` nicht deaktiviert ist.

source: This may lead to DNS problems.
de: Dies kann zu DNS Problemen führen.

source: This might indicate an error or still processing transactions.
de: Dies mag auf einen Fehler oder noch ausstehende Transaktionen hinweisen.

source: This warning might be harmless. Nevertheless make sure the authentication credentials (if any) are correct and the proxy server ACLs do not forbid requests to %s.
de: Diese Warnung könnte harmlos sein. Trotzdem sollte sichergestellt werden, dass Authentifikations-Zugangsdaten (falls existierend) korrekt sind und die ACL's des Proxy-Servers nicht verbieten, Anfragen an %s zu stellen.

source: UCS DN: {ucs}, S4 DN: {s4}, Filename: {fn}
de: UCS DN: {ucs}, S4 DN: {s4}, Dateiname: {fn}

source: UCS rejected:
de: Nicht synchronisierte UCS Objekte:

source: Unable to fix machine password on {}
de: Nicht im Stande das Password für das Rechnerkonto für {} zu korrigieren.

source: Univention Directory Notifier ID and the locally stored version differ.
de: Univention Directory Notifier ID und die lokal gespeicherte Version unterscheiden sich.

source: Univention S4 Connector is not installed.
de: Univention S4 Connector ist nicht installiert.

source: Univention Support Database - Bind: zone transfer failed
de: Univention Support Database - Bind: Zonentransfer fehlgeschlagen

source: Univention Support Database - Change the primary LDAP Server to redistribute the server load
de: Univention Support Database - Änderung des primären LDAP-Server zur Verteilung der Server Last

source: Univention Support Database - DNS Server on Directory Node does not resolve external names
de: Univention Support Database - DNS-Server auf dem Directory Node löst externe Namen nicht auf

source: Univention Support Database - How to deal with s4-connector rejects
de: Univention Support Database - Wie mit S4-Connector Konflikten umgehen

source: Univention Support Database - Manually trigger server password change
de: Univention Support Database - Serverpasswortänderung manuell auslösen

source: Univention Support Database - Renewing the TLS/SSL certificates
de: Univention Support Database - Erneuern der TLS/SSL-Zertifikate

source: Univention Support Database - Renewing the complete TLS/SSL certificate chain
de: Univention Support Database - Erneuern der ganzen TLS/SSL-Zertifikat-Kette

source: Univention Support Database - Troubleshooting: Listener-/Notifier
de: Univention Support Database - Listener-/Notifier-Fehlersuche

source: Update protocol version
de: Protokollversion anpassen

source: Updated versions will be named FILENAME.dpkg-*.
de: Aktualisierte Versionen werden DATEINAME.dpkg-* genannt.

source: Updating from PostgreSQL 11 to PostgreSQL 15
de: Aktualisierung von PostgreSQL 11 auf PostgreSQL 15

source: Use the module {ucr} to correct their values.
de: Benutzen Sie das Modul {ucr}, um diese Werte zu korrigieren.

source: Use the {appcenter:components} to correct these values by once saving the General repository settings
de: Verwenden Sie das {appcenter:components} um dies zu korrigieren, indem Sie die Konfiguration dort für die Allgmeinen Repository-Einstellungen

source: User objects which are not migrated
de: Noch nicht migrierte Nutzer Objekte

source: User or group with SID {sid} has name {actual!r}, but should be {expected!r}.
de: Der Nutzer oder die Gruppe mit der SID {sid} hat den Namen {actual!r}, sollte aber {expected!r} sein.

source: User or group with name {name!r} has sid {actual_sid}, but should be {sid}.
de: Der Nutzer oder die Gruppe mit dem Namen {name!r} hat die SID {actual_sid}, sollte aber {sid} haben.

source: Validating the LDAP configuration and schema files.
de: Validierung der LDAP-Konfigurations und Schema Dateien.

source: When a user object is created by a system which is not yet on UCS 4.3 it will have the old format. These user objects need to migrated again.
de: Wenn ein Nutzer auf System erstellt wurde, welches noch nicht auf UCS 4.3 ist, wird dieser im alten Format sein. Diese Nutzer Objekte müssen erneut migriert werden.

source: With UCS 4.3 the LDAP format of user objects changed. After upgrading the Primary Directory Node all user objects are migrated into the new format.
de: Mit UCS 4.3 hat sich das LDAP format von Nutzer Objekten geändert. Nach Upgrade des Primary Directory Node werden all Nutzer Objekte in das neue Format migriert.

source: You can run `/usr/share/univention-directory-manager-tools/proof_uniqueMembers` to fix the issue.
de: Sie können `/usr/share/univention-directory-manager-tools/proof_uniqueMembers` ausführen um das Problem zu beheben.

source: You can run `samba-tool dbcheck --fix` to fix the issue.
de: Sie können `samba-tool dbcheck --fix` ausführen um die Probleme zu beheben.

source: You have configured some high log levels.
de: Sie haben erhöhten Detailgrad für Logmeldungen eingestellt.

source: You may log in to the system as root via ssh and run the command "dpkg --configure -a" as an attempt to correct the packages status.
de: Um den Paketstatus zu korrigieren, loggen Sie sich am System per ssh als root ein und führen Sie das Kommando "dpkg --configure -a" aus.

source: You may want to move /var/log to another disk or storage.
de: Sie können /var/log auf eine andere Festplatte oder Speicher verschieben.

source: You may want to move the local repository to another server.
de: Sie können lokale Repositorys auf einen anderen Server auslagern.

source: You may want to reset them via {ucr}.
de: Sie können sie per {ucr} zurück setzen.

source: You may want to stop Heimdal KDC and restart Samba via {services}
de: Sie können Heimdal KDC per {services} stoppen und Samba neu starten.

source: You may want to uninstall software via {appcenter:appcenter}.
de: Sie können per {appcenter:appcenter} Software entfernen.

source: `/usr/share/univention-directory-manager-tools/proof_uniqueMembers -c` found an error with the LDAP database group membership attributes.
de: `/usr/share/univention-directory-manager-tools/proof_uniqueMembers -c` hat einen Fehler in der LDAP-Datenbank mit Gruppenmitgliedschafts-Attributen gefunden.

source: `/usr/share/univention-directory-manager-tools/proof_uniqueMembers -c` found no errors with the LDAP database group membership attributes.
de: `/usr/share/univention-directory-manager-tools/proof_uniqueMembers -c` hat keine Probleme in der LDAP-Datenbank mit Gruppenmitgliedschafts-Attributen gefunden.

source: `kinit` for principal {princ} with keytab {tab} failed.
de: `kinit` für den Principal {princ} mit der Password Tabelle {tab} ist fehlgeschlagen.

source: `kinit` for principal {princ} with password file {file} failed.
de: `kinit` für den Principal {princ} mit der Password Datei {file} ist fehlgeschlagen.

source: `nsupdate` check for domain {domain} failed ({details}).
de: `nsupdate` Prüfung für die Domänne {domain} ist fehlgeschlagen ({details}).

source: `samba-tool dbcheck` found an error in the local AD database.
de: `samba-tool dbcheck` fand einen Fehler in der lokalen AD Datenbank.

source: `samba-tool dbcheck` found no errors in the local AD database.
de: `samba-tool dbcheck` hat keine Fehler in der lokalen AD Datenbank gefunden.

source: `samba-tool drs showrepl` returned a problem with the replication.
de: `samba-tool drs showrepl` gibt ein Problem mit der Replikation zurück.

source: as well as saving the settings for all Additional repositories or press the Button ADJUST ALL COMPONENTS
de: und für alle zusätzlichen Repositories neu abspeichern, oder drücken Sie den Button ALLE KOMPONENTEN KORRIGIEREN

source: http://sdb.univention.de/1183
de: http://sdb.univention.de/1000

source: http://sdb.univention.de/1273
de: https://help.univention.com/t/bind-zone-transfer-failed/6573

source: http://sdb.univention.de/1298
de: https://help.univention.com/t/dns-server-on-dc-does-not-resolve-external-name/6568

source: https://docs.software-univention.de/manual-5.2.html#domain:listenernotifier:erroranalysis
de: https://docs.software-univention.de/handbuch-5.2.html#domain:listenernotifier:erroranalysis

source: not found
de: nicht gefunden

source: samba/interfaces does not contain lo, 127.0.0.1 or 0.0.0.0.
de: samba/interfaces enthält weder lo noch 127.0.0.1 noch 0.0.0.0.

source: some
de: einigen

source: to correct these settings and delete the obsolete variables.
de: um die Konfiguration zu korrigieren und die überflüssigen Variablen zu löschen.

source: Fetchmail attributes were not migrated
de: Die Fetchmail Attribute wurden nicht migriert.

source: It is not possible to automatically fix the problem when 'univention-fetchmail' is running on a non-master server.
de: Es ist nicht möglich, das Problem automatisch zu beheben, wenn 'univention-fetchmail' nicht auf einem Master Server läuft.

source: Migrate configurations
de: Konfigurationen migrieren

source: Not all old LDAP fetchmail configurations have been migrated or incomplete configurations remain in some objects.
de: Nicht alle alten LDAP Fetchmail Konfigurationen wurden migriert oder unvollständige Konfigurationen sind noch in einigen Objekten erhalten.

source: Run the script '/usr/share/univention-fetchmail/migrate-fetchmail.py --binddn $DN --bindpwdfile $PWDFILE' to migrate the complete configurations.
de: Führen Sie das Skript '/usr/share/univention-fetchmail/migrate-fetchmail.py --binddn $DN --bindpwdfile $PWDFILE' aus, um die vollständigen Konfigurationen zu migrieren.

source: The following complete configurations were found:
de: Die folgenden vollständigen Konfigurationen wurden gefunden:

source: The following incomplete configurations have been found. Manual action is required to fix it. Attributes still present from past configurations can be deleted.
de: Die folgenden unvollständigen Konfigurationen wurden gefunden. Zur Behebung sind manuelle Maßnahmen erforderlich. Attribute, die noch aus früheren Konfigurationen vorhanden sind, können gelöscht werden.

source: User: %r
de: Benutzer: %r

source: User: %r - remaining fetchmail attributes: %s.
de: Benutzer: %r - verbleibende Fetchmail Attribute: %s.
