Repository: sanyaade-teachings/univention-corporate-server
Catalog: management/univention-management-console-module-diagnostic/umc/python/diagnostic/*.po
Languages: de

source: "univention-check-join-status" returned a problem with the domain join.
de: "univention-check-join-status" gab einen Fehler mit dem Domänenbeitritt zurück.

source: %d objects should be "%s"
de: %d Objekte sollten "%s" sein

source: %d of the configured nameservers are not responding to DNS queries.
de: %d der konfigurierten Nameserver anworten nicht auf DNS-Anfragen.

source: - Disk for mountpoint %(mp)s is %(pc)s%% full.
de: - Festplatte für Moint Point %(mp)s ist %(pc)s%% voll.

source: A timeout occurred while reaching the nameserver (is it online?).
de: Eine Zeitüberschreitung trat beim Erreichen des Nameservers auf (ist er online?).

source: ACL right for group {id!r} is {udm!r} in UDM, but {imap!r} in IMAP.
de: ACL Berechtigung für die Gruppe {id!r} ist {udm!r} in UDM, aber {imap!r} in IMAP.

source: ACL right for user {id!r} is {udm!r} in UDM, but {imap!r} in IMAP.
de: ACL Berechtigung für den Nutzer {id!r} ist {udm!r} in UDM, aber {imap!r} in IMAP.

source: Add lo to samba/interfaces
de: Füge lo zu samba/interfaces hinzu

source: Adjust all components
de: Alle Komponenten korrigieren

source: Adjust to suggested limits
de: An vorgeschlagene Limits anpassen

source: After fixing the problem please use the Repository Settings module to check the changes made
de: Nach der Korrektur der Variablen prüfen Sie bitte im Repository Einstellungen Modul welche Änderungen gemacht wurden.

source: All SIDs exist and names are consistent.
de: Alle SIDs existieren und die Namen sind konsistent.

source: All SSL certificates valid.
de: Alle SSL Zertifikate sind gültig.

source: All files ok.
de: Alle Dateien in Ordnung.

source: All shared folder ACLs are in sync with UDM.
de: Alle ACL Einträge der globalen IMAP Ordner stimmen mit UDM überein.

source: As of UCS {ucs[0]}.{ucs[1]}, PostgreSQL {postgresql_version[0]} should be used. This step has to be performed manually as described in
de: Ab UCS {ucs[0]}.{ucs[1]} sollte PostgreSQL Version {postgresql_version[0]} sein. Dieser Schritt muss manuell durchgeführt werden, wie in

source: As these variables should be no longer used, this check has been added to check for the existence of these variables.
de: Dieser Check wurde eingeführt, um das Vorhandensein dieser Variablen zu prüfen, weil diese Variablen nicht mehr benutzt werden sollen.

source: Authentication against the Primary LDAP failed with the machine password.
de: Authentifizierung gegen das Primary LDAP mit dem Password für das Rechnerkonto ist fehlgeschlagen.

source: Authentication against the local LDAP failed with the machine password.
de: Authentifizierung gegen das lokale LDAP mit dem Password für das Rechnerkonto ist fehlgeschlagen.

source: Authentication with machine password against LDAP successful.
de: Authentifizierung mit dem Password für das Rechnerkonto erfolgreich.

source: Calling /usr/lib/univention-server/server_password_change failed.
de: Aufruf von /usr/lib/univention-server/server_password_change ist fehlgeschlagen.

source: Certificate {path!r} will expire in {days} days.
de: Zertifikat {path!r} wird in {days} Tagen ablaufen.

source: Check Heimdal KDC on Samba 4 DC
de: Überprüfe Heimdal KDC auf Samba 4 DC

source: Check IMAP shared folder ACLs
de: Überprüfe ACL Einträge der globalen IMAP Ordner

source: Check LDAP database for inconsistencies in group memberships.
de: Teste die LDAP-Datenbank auf Inkonsistenzen in Gruppen-Mitgliedschaften.

source: Check Samba replication status for errors
de: Überprüfe den Samba Replikations Status

source: Check UCR variable values for correctness
de: Überprüfe Werte der UCR Variablen auf Korrektheit

source: Check currently installed PostgreSQL version
de: Überprüfe aktuell installierte PostgreSQL Version

source: Check errors in sources.list files
de: Überprüfe Fehler in den sources.list Dateien

source: Check file permissions
de: Überprüfe Datei Berechtigungen

source: Check for modified UCR templates
de: Überprüfe veränderte UCR Vorlagen

source: Check for problems with UDN replication
de: Überprüfe Probleme mit der UDN Replikation

source: Check free disk space
de: Überprüfe freien Festplatten Platz

source: Check hostname RFC compliance
de: Überprüfe Rechnernamen auf RFC Konformität

source: Check join status
de: Überprüfe den Zustand des Domänenbeitritts

source: Check kerberos authenticated DNS updates
de: Überprüfe Kerberos authentifizierte DNS Updates

source: Check local AD database for errors
de: Teste die lokale AD Datenbank auf Fehler

source: Check machine password
de: Password für das Rechnerkonto testen

source: Check nameserver entries on DNS zones
de: Überprüfe die Nameserver Einträge der DNS Zonen

source: Check of the protocol version of the Univention Directory Notifier
de: Überprüfung der Protokollversion des Univention Directory Notifier

source: Check primary LDAP server
de: Überprüfung des primären LDAP-Servers

source: Check repository configuration for correctness
de: Repository Konfiguration auf Korrektheit prüfen

source: Check resolving repository servers
de: Überprüfe DNS Auflösung der Repository Server

source: Check the LDAP database for inconsistencies in group membership attributes.
de: Teste die LDAP-Datenbank auf Inkonsistenzen in Gruppen-Mitgliedschaften.

source: Check validity of SSL certificates
de: Überprüfe Gültigkeit der SSL Zertifikate

source: Check well known SIDs
de: Überprüfe 'Well Known' SIDs

source: Cleanup of deprecated variables is executed !
de: Die Korrektur der veralteten Variablen wird ausgeführt !

source: Deactivate test
de: Test deaktivieren

source: Enough free disk space available.
de: Außreichend freier Festplatten Platz vorhanden.

source: Error retrieving notifier ID from the UDN.
de: Fehler beim Abrufen der letzten Transaktions ID vom UDN.

source: Errors found by `univention-check-templates`.
de: Es wurden Fehler durch `univention-check-templates` gefunden.

source: Errors occurred while running `kinit` or `nsupdate`.
de: Fehler traten auf bei der Ausführung von `kinit` oder `nsupdate`.

source: Failed to find any certificate in {cert!r}
de: Konnte kein Zertifikat in {cert!r} finden

source: Failed to find any certificate in {{{link}}}
de: Konnte kein Zertifikat in {{{link}}} finden

source: Failed to load certificate {cert!r}: {exc}
de: Zertifikat {cert!r} konnte nicht geladen werden: {exc}

source: Failed to load certificate {{idp}}: {exc}
de: Zertifikat {{idp}} konnte nicht geladen werden: {exc}

source: Failed to load certificate {{{link}}}: {exc}
de: Zertifikat {{{link}}} konnte nicht geladen werden: {exc}

source: File {path!r} does not exist.
de: Datei {path!r} existiert nicht.

source: File {path!r} has mode {actual:o}, {expected:o} was expected.
de: Datei {path!r} hat Datei-Modus {actual:o}, {expected:o} war erwartet.

source: File {path!r} has owner {actual!r} while {expected!r} was expected.
de: Datei {path!r} hat den Besitzer {actual!r}, während {expected!r} erwartet war.

source: Fix Primary LDAP server configuration
de: Korrigier primären LDAP-Server Konfiguration

source: Fix machine password
de: Korrigiere Password für das Rechnerkonto

source: Found differences in the ACLs for IMAP shared folders between UDM and IMAP.
de: Es wurde ein Unterschied in den ACL Einträge für die globalen IMAP Ordner zwischen UDM und IMAP gefunden.

source: Found errors in the nameserver entries of the following zones.
de: Es wurden Fehler in den Nameserver Einträgen der folgenden Zonen gefunden.

source: Found exception in {path!r}: {exception}
de: Fehler in {path!r} gefunden: {exception}

source: Found expired certificate {path!r}.
de: Abgelaufenes Zertifikat {path!r} gefunden.

source: Found illegal alias record (CNAME record) for nameserver {ns}.
de: Ungültiger Alias-Record (CNAME record) für Namenserver {ns} gefunden.

source: Found invalid certificate {path!r}.
de: Ungültiges Zertifikat {path!r} gefunden.

source: Found invalid certificate {path!r}: {message}
de: Ungültiges Zertifikat {path!r} gefunden: {message}

source: Found malformed certificate {path!r}.
de: Korruptes Zertifikat {path!r} gefunden.

source: Found no host record (A/AAAA record) for nameserver {ns}.
de: Kein Host-Record (A/AAAA record) für Namenserver {ns} gefunden.

source: Found not yet valid certificate {path!r}.
de: Noch nicht gültiges Zertifikat {path!r} gefunden.

source: Found {ucs} UCS rejects and {s4} S4 rejects. See {{sdb}} for more information.
de: {ucs} nicht synchronisierte UCS Objekte und {s4} nicht synchronisierte S4 Objekte. Weitere Hinweise finden Sie unter {{sdb}}.

source: Furthermore, it is checked if the scheme of the server variable is either http or https
de: Es wird auch geprüft, ob das Schema der Server-Variablen http oder https ist.

source: Gateway is not reachable
de: Gateway ist nicht erreichbar

source: Host key for server does not match
de: SSH Host-Key des Servers stimmt nicht überein

source: If the problem persists make sure the nameserver is connected to the network and the forwarders are able to reach the internet (www.univention.de).
de: Falls das Problem bestehen bleibt stellen Sie sicher, dass der Nameserver mit dem Netzwerk verbunden ist und die DNS-Forwarder das Internet erreichen können (www.univention.de).

source: If these settings are correct the problem relies in the gateway itself:
de: Wenn diese Einstellungen richtig sind liegt das Problem im Gateway selbst:

source: If you renewed your certificates please see {sdb-one} and {sdb-all} for more instructions. In that case the new certificate must be re-uploaded into LDAP.
de: Falls Sie die Zertifikate erneuert haben bitte {sdb-one} und {sdb-all} für weitere Anweisungen beachten. In diesem Fall muss das Zertifikat neu in LDAP geladen werden.

source: In forward zone {name} (see {{{link}}}):
de: In der Forward-Zone {name} (siehe {{{link}}}):

source: In mail folder {name} (see {{udm:mail/mail}}):
de: Im globalen Mail Ordner {name} (siehe {{udm:mail/mail}}):

source: In reverse zone {name} (see {{{link}}}):
de: In der Reverse-Zone {name} (siehe {{{link}}}):

source: Inbound {nc!r}: error during DRS replication from {source} ({estring})
de: In eingehend {nc!r}: Fehler während der DRS Replikation von {source} ({estring}).

source: Checking Samba database type
de: Prüfe Samba-Datenbank Typ

source: As of UCS {ucs[0]}.{ucs[1]}, Samba should use mdb as for its database. The steps to migrate the Samba database from tdb to mdb can be found in:
de: Ab UCS {ucs[0]}.{ucs[1]} sollte Samba mit einer Datenbank vom Typ mdb betrieben werden. Die Schritte für die Migration von tdb zu mdb finden Sie hier:

source: Migrate Samba database from tdb to mdb
de: Migration der Samba-Datenbank von tdb zu mdb

source: Deprecated Samba database type tdb.
de: Veralteter Samba-Datenbank Typ tdb.

source: Invalid type %(type)r defined for variable %(variable)r.
de: Ungültiger Typ %(type)r für Variable %(variable)r definiert.

source: It is suggested to increase the security limits either manually by using {ucr} or to automatically adjust them to the suggested limits:
de: Es ist empfohlen, die Sicherheitslimits entweder manuell durch benutzen des {ucr} oder durch automatische Anpassung auf die empfohlenen Limits zu erhöhen.

source: KDC service check
de: KDC Erreichbarkeit

source: LDAP configuration files are valid.
de: LDAP-Konfigurationsdateien sind ungültig.

source: LDAP objects
de: LDAP-Objekte

source: LDAP schema files are not properly registered
de: LDAP-Schemadateien sind nicht ordentlich registriert

source: Login to the remote server with the uid %(uid)s and the password from /etc/machine.secret failed.
de: Der Login auf dem entfernten Rechner mit der uid %(uid)s und dem Passwort aus /etc/machine.secret is fehlgeschlagen.

source: Machine authentication failed
de: Authentifizierung mit dem Maschinen-Konto ist fehlgeschlagen

source: Mail folder {folder!r} does not exist in IMAP.
de: Globaler IMAP Order {folder!r} existiert nicht in IMAP.

source: Make sure the hardware of the gateway device is working properly.
de: Stellen Sie sicher, dass die Hardware des Gateway-Geräts korrekt funktioniert.

source: Manual: Analysis of listener/notifier problems
de: Handbuch: Analyse von Listener/Notifier-Problemen

source: Migrate %d LDAP objects
de: Migriere %d LDAP-Objekte

source: Migrate user objects
de: Migriere Nutzer Objekte

source: More information about the cause can be gained by executing "dpkg --audit".
de: Weitere Informationen über die Ursache können durch Ausführen von "dpkg --audit" erhalten werden.

source: Multiple ACL entries for {id!r} in UDM.
de: Mehrere ACL Einträge für {id!r} in UDM.

source: Nameserver(s) are not responsive
de: Nameserver sind nicht ansprechbar

source: No PostgreSQL version found.
de: Keine PostgreSQL-Version gefunden.

source: No S4 Connector rejects were found.
de: Keine nicht synchronisierten S4 Connector Objekte gefunden.

source: No errors found.
de: Keine Fehler gefunden.

source: No errors occurred.
de: Es traten keine Fehler auf.

source: No http/https used as scheme in %(name)r: %(value)r.
de: Das Schema ist weder http noch https in Variable: %(name)r: %(value)r

source: No non-compliant hostnames found.
de: Keine nicht konformen Rechnernamen gefunden.

source: No problems found with UDN replication.
de: Keine Prolbleme mit der UDN Replikation gefunden.

source: No problems found with modified UCR templates
de: Keine Probleme mit modifizierten UCR Vorlagen gefunden.

source: No problems were found while resolving update repositories.
de: Es wurden keine Probleme beim Auflösen der Repository-Server gefunden.

source: No reachable KDCs were found.
de: Keine erreichbaren KDCs gefunden.

source: No user or group with SID {sid} found, expected {expected!r}.
de: Kein Nutzer oder keine Gruppe mit SID {sid} gefunden, {expected!r} war erwartet.

source: Note that password rotation is disabled via the UCR variable server/password/change.
de: Beachten Sie, dass die Passwordrotation durch die UCR Variable server/password/change deaktiviert ist.

source: Note that server/password/interval is set to {}.
de: Beachten Sie, dass server/password/interval auf {} gesetzt ist.

source: Number of objects that should be marked as "%s": %d
de: Anzahl an Objekten die als "%s" markiert sein sollten: %d

source: Number of unspecific Windows computer objects with inconsistent univentionObjectType: %d (Can't fix this automatically)
de: Anzahl unspezifischer Windows-Computer-Objekte mit inkonsistentem univentionObjectType: %d (Lässt sich nicht automatisiert korrigieren)

source: Objects that implicitly satisfy the criteria of a Univention Object but lack this attribute should be migrated.
de: Objekte, die die Anforderungen eines Univention-Objekts implizit erfüllen, aber dieses Attribut nicht gesetzt haben, sollten migriert werden.

source: Objects that implicitly satisfy the standards of a Univention Object but lack this attribute should be migrated.
de: Objekte, die die Anforderungen eines Univention-Objekts implizit erfüllen, aber dieses Attribut nicht gesetzt haben, sollten migriert werden.

source: Old packages and Apps registered schema files by copying the files locally into a certain directory.
de: Alte Pakete und Apps haben Schemadateien registriert, indem sie sie lokal in ein bestimmtes Verzeichnis kopierten.

source: Outbound {nc!r}: error during DRS replication to {source} ({estring})
de: In ausgehend {nc!r}: Fehler während der DRS Replikation nach {source} ({estring}).

source: Output of `{cmd}`:
de: Ausgabe von `{cmd}`:

source: Package status corrupt
de: Paketstatus korrupt

source: Please check /var/log/auth.log on the remote server for further information.
de: Bitte prüfen Sie /var/log/auth.log auf dem entfernten Rechner für weitere Informationen.

source: Please check the files for more details.
de: Überprüfen Sie die Dateien für mehr Details.

source: Please investigate them if you experience any problems on this system.
de: Bitte untersuchen Sie diese wenn Sie auf diesem System Probleme beobachten.

source: Please make sure the DNS settings in the {setup:network} are correctly set up.
de: Bitte sicherstellen, dass die DNS-Einstellungen in {setup:network} korrekt konfiguriert sind.

source: Please refer to {rfc1123} for the syntax of host names.
de: Siehe {rfc1123} für die Syntax von Rechnernamen.

source: Please refer to {sdb} for further information.
de: Siehe {sdb} für weitere Informationen.

source: Please repair the host key of the remote server in /root/.ssh/known_hosts on %(fqdn)s.
de: Der SSH Host-Key in /root/.ssh/known_hosts des entfernten Rechners muss auf %(fqdn)s repariert werden.

source: Please see {sdb} for more information.
de: Siehe {sdb} für weitere Informationen.

source: Please see {sdb} for troubleshooting DNS problems.
de: Siehe {sdb} für Problemhilfe bei DNS Problemen.

source: Please see {sdb} on how to renew certificates.
de: Siehe {sdb} für Informationen zum Erneuern von Zertifikaten.

source: PostgreSQL version is {current}, should be {desired}.
de: PostgreSQL Version ist {current}, sollte {desired} sein.

source: Primary LDAP server check
de: Überprüfung des primären LDAP-Servers

source: Proxy server failure
de: Proxy-Server-Fehler

source: RFC 1123 - 2.1 Host Names and Numbers
de: RFC 1123 - 2.1 Rechernamen und Nummern

source: Re-execute the join-script <tt>92univention-management-console-web-server</tt> via {join} or execute <tt>univention-run-join-scripts --force --run-scripts 92univention-management-console-web-server</tt> on the command line as user <i>root</i>.
de: Führen Sie das Join-Skript <tt>92univention-management-console-web-server</tt> via {join} oder <tt>univention-run-join-scripts --force --run-scripts 92univention-management-console-web-server</tt> auf der Befehlszeile as Benutzer <i>root</i> aus.

source: Re-run join script
de: Join-Skript erneut ausführen.

source: Re-upload certificate
de: Zertifikat erneut hochladen

source: Regenerate sources.list
de: Source-Listen neu generieren

source: Register Schema files
de: Schemadateien registrieren

source: Reset kerberos/kdc to 127.0.0.1
de: Setze kerberos/kdc auf 127.0.0.1 zurück

source: Run `/usr/share/univention-directory-manager-tools/proof_uniqueMembers`
de: Führe `/usr/share/univention-directory-manager-tools/proof_uniqueMembers` aus

source: Run `samba-tool dbcheck --fix --cross-ncs --yes`
de: Führe `samba-tool dbcheck --fix --cross-ncs --yes` aus

source: S4 Connector rejects
de: Nicht synchronisierte S4 Connector Objekte

source: S4 rejected:
de: Nicht synchronisierte S4 Objekte:

source: SAML certificate verification failed!
de: Überprüfung der SAML-Zertifikate fehlgeschlagen!

source: SSH connection to UCS server failed!
de: SSH-Verbindung zu anderem UCS Server fehlgeschlagen!

source: Samba 4 KDC running.
de: Samba 4 KDC läuft.

source: Security limits exceeded
de: Sicherheitslimits überschritten

source: See {erroranalysis} or run the join-scripts via {join}.
de: Siehe {erroranalysis} oder führen Sie ausstehende JOIN-Skripte via {join} aus.

source: See {sdb} for information on manual server password change.
de: Siehe {sdb} für weitere Informationen für einen manuellen Tausch des Passwords für das Rechnerkonto.

source: Set server/password/change=True
de: Setze server/password/change=True

source: Set server/password/interval=21
de: Setze server/password/interval=21

source: Several services rely on the attribute "univentionObjectType" to search and identify objects in LDAP.
de: Verschiedene Dienste vertrauen auf das Attribut "univentionObjectType", um nach Objekten im LDAP zu suchen oder diese zu identifizieren.

source: Several services rely on the attribute "univentionServerRole" to search and identify objects in OpenLDAP.
de: Verschiedene Dienste vertrauen auf das Attribut "univentionServerRole", um nach Objekten in OpenLDAP zu suchen oder diese zu identifizieren.

source: Some UCR variables currently have invalid values.
de: Einige UCR-Variablen haben momentan ungültige Werte.

source: Some UCR variables for the repository configuration are deprecated.
de: Einige UCR Variablen für die Repository Konfiguration sind veraltet.

source: Some disks are nearly full:
de: Einige Festplatten sind beinahe voll:

source: Starting with UCS {ucs[0]}.{ucs[1]}-{ucs[2]} erratum {ucs[3]}, the minimum protocol version should be set to {udn}.
de: Ab UCS {ucs[0]}.{ucs[1]}-{ucs[2]} Erratum {ucs[3]} sollte die minimale Protokollversion auf {udn} angehoben sein.

source: Test again
de: Erneut testen

source: The LDAP schema validation failed with the following errors or warnings:
de: Die LDAP-Schema-Validierung ist mit den folgenden Fehlern oder Warnungen fehlgeschlagen:

source: The SAML identity provider certificate {cert!r} is missing in {{idp}}.
de: Das SAML Identity Providers Zertifikat {cert!r} fehlt in {{idp}}.

source: The SAML identity provider certificate {cert!r} is missing in {{{link}}}.
de: Das SAML Identity Providers Zertifikat {cert!r} fehlt in {{{link}}}.

source: The SAML identity provider certificate {{{link}}} does not match the local certificate {loc!r}.
de: Das SAML Identity Provider Zertifikat {{{link}}} entspricht nicht dem lokalen Zertifikat {loc!r}.

source: The UCR variable <tt>{ucr}</tt> is not configured or invalid.
de: Die UCR-Variable <tt>{ucr}</tt> ist nicht konfiguriert oder ungültig.

source: The UCR variable {variable!r} is unset, but necessary for the S4 Connector.
de: Die UCR-Variable {variable!r} ist nicht gesetzt, aber notwendig für den S4 Connector.

source: The check for the join status was succsesful.
de: Die Überprüfung des Domänenbeitritts war erfolgreich.

source: The error might be fixable by regenerating the sources.list.
de: Dieser Fehler könnte durch eine erneute Generierung der Source-Listen behoben werden.

source: The files should be checked for differences.
de: Die Dateien sollten auf Unterschiede geprüft werden.

source: The following FQDNs were not resolvable:
de: Die folgenden FQDNs waren nicht auflösbar:

source: The following KDCs were unreachable: {}
de: Die folgenden KDCs waren nicht erreichbar: {}

source: The following UCR files are modified locally.
de: Die folgenden UCR Vorlagen wurden lokal verändert.

source: The following files seem to be registered in the old way:
de: Die folgenden Dateien scheinen auf dem veralteten Weg registriert worden zu sein:

source: The following list shows the affected remote servers and the reason for the failed ssh connection:
de: Die folgende Liste zeigt die betroffenen entfernten Rechner und den Grund für die fehlgeschlagene SSH-Verbindung.

source: The following non-compliant hostnames have been found: {hostnames}.
de: Die folgenden nicht konformen Rechnernamen wurden gefunden: {hostnames}.

source: The gateway %r could not be reached. Please make sure the gateway and related network settings are correctly configured by using the {setup:network}.
de: Das gateway %r konnte nicht erreicht werden. Bitte durch Benutzung des {setup:network} sicherstellen, dass Gateway- und zusammengehörige Netzwerkeinstellungen korrekt konfiguriert sind.

source: The hostname of the proxy could not be resolved. May check your DNS configuration.
de: Der Rechnername des Proxies konnte nicht aufgelöst werden. Bitte DNS-Konfiguration überprüfen.

source: The limits have been adjusted to the suggested value.
de: Die Limits wurden auf die empfohlenen Werte erhöht.

source: The migration failed: %s
de: Die Migration schlug fehl: %s

source: The migration status can be checked by executing: pg_lsclusters -h.
de: Der Migrationsstatus kann mit `pg_lsclusters -h` überprüft werden.

source: The nameserver %(nameserver)s (UCR variable %(var)r) is not responsive:
de: Der Nameserver %(nameserver)s (UCR Variable %(var)r) ist nicht ansprechbar:
